rishi-latchmepersad/embedded-gauge-reading-tinyml/firmware/stm32/n657/Appli/Src/app_ai.c
/* Source-crop-box model pool (mobilenetv2_source_crop_box_v1_stripped_int8). */

__attribute__((section(".xspi2_source_crop_box_pool"), aligned(APP_AI_CACHE_LINE_BYTES)))

uint8_t _mem_pool_xSPI2_mobilenetv2_source_crop_box_v1_stripped_int8[32U] = {

	0U,

};

/* Tip-focus geometry model pool.  The generated network (via
 * LL_ATON_DECLARE_NAMED_NN_INSTANCE_AND_INTERFACE(Default)) references
 * _mem_pool_xSPI2_Default, and this 32-byte placeholder keeps that xSPI2
 * symbol alive at the address where the NPU weight blob
 * (network_atonbuf.xSPI2.raw) is flashed (0x70400000).
 *
 * IMPORTANT: The actual weights data (2.2MB) is NOT stored in this array.
 * The data lives in xSPI2 flash at 0x70400000, and must be flashed using
 * flash_boot.bat before running inference. This 32-byte symbol is just a
 * linker marker that gets placed at 0x70400000 by the .xspi2_tip_focus_pool
 * section. When the NPU accesses weights, it reads from xSPI2 flash through
 * the memory-mapped window (0x70000000+), not from this RAM array.
 *
 * If you see a HardFault at address 0x8D or similar during inference, it
 * means the xSPI2 flash was not programmed. Run flash_boot.bat to flash
 * network_atonbuf.xSPI2.raw to 0x70400000. */
__attribute__((section(".xspi2_tip_focus_pool"), aligned(APP_AI_CACHE_LINE_BYTES)))
uint8_t _mem_pool_xSPI2_Default[32U] = { 0U, };
static uint8_t app_ai_xspi2_program_buffer[APP_AI_XSPI2_PROGRAM_CHUNK_BYTES];
__attribute__((aligned(APP_AI_CACHE_LINE_BYTES)))
static uint8_t app_ai_scalar_row_scratch[APP_AI_CAPTURE_FRAME_WIDTH_PIXELS * APP_AI_CAPTURE_FRAME_BYTES_PER_PIXEL];
__attribute__((aligned(APP_AI_CACHE_LINE_BYTES)))
static uint8_t app_ai_scalar_output_row_scratch[APP_AI_CAPTURE_FRAME_WIDTH_PIXELS * 3U * sizeof(float)];
__attribute__((aligned(APP_AI_CACHE_LINE_BYTES)))
static uint8_t app_ai_dry_run_frame_scratch[APP_AI_CAPTURE_FRAME_BYTES] __attribute__((section(".npusram6")));
volatile size_t app_ai_scalar_preprocess_last_row = (size_t)SIZE_MAX;
/* Trace the scalar resize loop only every so often so we can tell whether it
 * is progressing without flooding UART in the hot path. */
#define APP_AI_SCALAR_PREPROCESS_ROW_TRACE_INTERVAL_ROWS 32U
/* Keep each preprocessing pass small enough that we can reshape the scalar
 * path without one huge monolithic row loop. */
#define APP_AI_SCALAR_PREPROCESS_ROWS_PER_CHUNK 8U
/* Start/tail signatures for the current atonbuf.xSPI2.raw.
 * Update these when a new model is exported by running:
 *   python3 -c "
 *     d=open('st_ai_output/atonbuf.xSPI2.raw','rb').read()
 *     print('start:', bytes(d[:16]).hex())
 *     print('tail: ', bytes(d[-16:]).hex())" */
/* Scalar model: atonbuf.xSPI2.raw (66,081 bytes) flashed at 0x70200000. */
static const uint8_t app_ai_xspi2_signature_start[APP_AI_XSPI2_PROBE_BYTES] = {
	0xD0U, 0xFBU, 0xD7U, 0x0CU, 0xBFU, 0xAFU, 0xEEU, 0x1AU,
	0xFAU, 0x40U, 0xD5U, 0x63U, 0xE2U, 0x54U, 0xD8U, 0x64U,
};
static const uint8_t app_ai_xspi2_signature_tail[APP_AI_XSPI2_PROBE_BYTES] = {
	0x00U, 0x00U, 0x00U, 0x00U, 0x00U, 0x00U, 0x00U, 0x00U,
	0x00U, 0x00U, 0x00U, 0x00U, 0x00U, 0x00U, 0x00U, 0x83U,
};
/* Rectifier v3 xSPI2 signatures used when the board boots with the rectifier
 * blob already flashed at 0x70200000. Size: 121,217 bytes. */
static const uint8_t app_ai_rectifier_xspi2_signature_start[APP_AI_XSPI2_PROBE_BYTES] = {
	0x0FU, 0x11U, 0xF8U, 0x10U, 0xD0U, 0xD8U, 0x0EU, 0x28U,
	0x99U, 0xCEU, 0x98U, 0x7DU, 0xBCU, 0x42U, 0x5EU, 0xF2U,
};
static const uint8_t app_ai_rectifier_xspi2_signature_tail[APP_AI_XSPI2_PROBE_BYTES] = {
	0x00U, 0x00U, 0x00U, 0x00U, 0x00U, 0x00U, 0x00U, 0x00U,
	0x00U, 0x00U, 0x00U, 0x00U, 0x00U, 0x00U, 0x00U, 0x80U,
};
/* prodv0.3 OBB xSPI2 signatures. */
static const uint8_t app_ai_obb_xspi2_signature_start[APP_AI_XSPI2_PROBE_BYTES] = {
	0xF2U,
	0x17U,
	0x29U,
	0xE2U,
	0xDCU,
	0xEBU,
	0xEDU,
	0x04U,
	0x09U,
	0x01U,
	0x35U,
	0xEBU,
	0x14U,
	0xDEU,
	0x0FU,
	0x02U,
};
static const uint8_t app_ai_obb_xspi2_signature_tail[APP_AI_XSPI2_PROBE_BYTES] = {
	0x00U,
	0x00U,
	0x00U,
	0x00U,
	0x00U,
	0x00U,
	0x00U,
	0x00U,
	0x00U,
	0x00U,
	0x00U,
	0x00U,
	0x00U,
	0x00U,
	0x00U,
	0x7FU,
};

/* Source-crop-box xSPI2 signatures for atonbuf.source_crop_box.xSPI2.raw. */
static const uint8_t app_ai_source_crop_box_xspi2_signature_start[APP_AI_XSPI2_PROBE_BYTES] = {
	0xF2U, 0x17U, 0x29U, 0xE2U, 0xDCU, 0xEBU, 0xECU, 0x04U,
	0x09U, 0x01U, 0x35U, 0xEBU, 0x14U, 0xDEU, 0x0FU, 0x02U,
};
static const uint8_t app_ai_source_crop_box_xspi2_signature_tail[APP_AI_XSPI2_PROBE_BYTES] = {
	0x00U, 0x00U, 0x00U, 0x00U, 0x00U, 0x00U, 0x00U, 0x00U,
	0x00U, 0x00U, 0x00U, 0x00U, 0x00U, 0x00U, 0x00U, 0x80U,
};
/* Tip-focus geometry model xSPI2 signatures for network_atonbuf.xSPI2.raw.
 * Flashed to 0x70400000. Size: 2,201,505 bytes. */
static const uint8_t app_ai_tip_focus_xspi2_signature_start[APP_AI_XSPI2_PROBE_BYTES] = {
	0x04U, 0x2FU, 0x1FU, 0xF2U, 0x62U, 0xE7U, 0x3EU, 0xFDU,
	0x0AU, 0x1EU, 0xF4U, 0x32U, 0xD4U, 0x9AU, 0xFEU, 0xC2U,
};
static const uint8_t app_ai_tip_focus_xspi2_signature_tail[APP_AI_XSPI2_PROBE_BYTES] = {
	0x00U, 0x00U, 0x00U, 0x00U, 0x00U, 0x00U, 0x00U, 0x00U,
	0x00U, 0x00U, 0x00U, 0x00U, 0x00U, 0x00U, 0x00U, 0x80U,
};
/* Per-stage programmed sizes. Set during provisioning and used by the verify
 * functions for the tail probe offset. Keeping them separate prevents the
 * scalar tail check from using the rectifier's file size (or vice-versa) when
 * stages alternate. */
static ULONG app_ai_scalar_programmed_size = 0UL;
static ULONG app_ai_rectifier_programmed_size = 0UL;
static ULONG app_ai_obb_programmed_size = 0UL;
static ULONG app_ai_source_crop_box_programmed_size = 0UL;
static ULONG app_ai_tip_focus_programmed_size = 0UL;
/* Legacy alias kept so existing references still compile; points to the scalar
 * size which was the only stage before the rectifier was added. */
static ULONG app_ai_xspi2_programmed_size = 0UL;

/* Per-stage signature caches populated from the SD file during provisioning.
 * Using SD-sourced bytes means verify never goes stale when the model blob is
 * replaced, regardless of what the hardcoded fallback constants say. */
static uint8_t app_ai_scalar_sig_start[APP_AI_XSPI2_PROBE_BYTES] = {0U};
static uint8_t app_ai_scalar_sig_tail[APP_AI_XSPI2_PROBE_BYTES] = {0U};
static bool app_ai_scalar_sig_valid = false;
static uint8_t app_ai_rectifier_sig_start[APP_AI_XSPI2_PROBE_BYTES] = {0U};
static uint8_t app_ai_rectifier_sig_tail[APP_AI_XSPI2_PROBE_BYTES] = {0U};
static bool app_ai_rectifier_sig_valid = false;
static uint8_t app_ai_obb_sig_start[APP_AI_XSPI2_PROBE_BYTES] = {0U};
static uint8_t app_ai_obb_sig_tail[APP_AI_XSPI2_PROBE_BYTES] = {0U};
static bool app_ai_obb_sig_valid = false;
static uint8_t app_ai_source_crop_box_sig_start[APP_AI_XSPI2_PROBE_BYTES] = {0U};
static uint8_t app_ai_source_crop_box_sig_tail[APP_AI_XSPI2_PROBE_BYTES] = {0U};
static bool app_ai_source_crop_box_sig_valid = false;
static uint8_t app_ai_tip_focus_sig_start[APP_AI_XSPI2_PROBE_BYTES] = {0U};
static uint8_t app_ai_tip_focus_sig_tail[APP_AI_XSPI2_PROBE_BYTES] = {0U};
static bool app_ai_tip_focus_sig_valid = false;

/* Declare the generated NN instance locally so the dry-run helper can run the
 * AtoNN runtime on the exact network produced by Cube.AI. */
LL_ATON_DECLARE_NAMED_NN_INSTANCE_AND_INTERFACE(
	polar_vote_circular_v28_int8);
LL_ATON_DECLARE_NAMED_NN_INSTANCE_AND_INTERFACE(
	mobilenetv2_rectifier_hardcase_finetune);
LL_ATON_DECLARE_NAMED_NN_INSTANCE_AND_INTERFACE(
	mobilenetv2_obb_longterm);
LL_ATON_DECLARE_NAMED_NN_INSTANCE_AND_INTERFACE(
	mobilenetv2_source_crop_box_v1_stripped_int8);

typedef struct AppAI_ModelStageSpec AppAI_ModelStageSpec;

struct AppAI_ModelStageSpec
{
	const char *stage_label;
	const char *model_image_path;
	NN_Instance_TypeDef *nn_instance;
	bool (*network_init_fn)(void);
	bool (*inference_init_fn)(void);
	bool uses_rectifier_box;
	uint32_t xspi2_chip_offset; /* byte offset from chip base (0x70000000) */
	uint32_t xspi2_base_addr;	/* mapped window address for this stage */
};

typedef struct
{
	float center_x;
	float center_y;
	float box_w;
	float box_h;
} AppAI_RectifierBox;

typedef struct
{
	float center_x;
	float center_y;
	float box_w;
	float box_h;
	float angle_cos;
	float angle_sin;
	float theta_rad;
} AppAI_ObbBox;

typedef struct
{
	size_t x_min;
	size_t y_min;
	size_t width;
	size_t height;
} AppAI_SourceCrop;

static const AppAI_ModelStageSpec app_ai_scalar_stage = {
	.stage_label = "scalar",
	.model_image_path = APP_AI_SCALAR_XSPI2_MODEL_IMAGE_PATH,
	.nn_instance = &NN_Instance_polar_vote_circular_v28_int8,
	.network_init_fn =
		LL_ATON_EC_Network_Init_polar_vote_circular_v28_int8,
	.inference_init_fn =
		LL_ATON_EC_Inference_Init_polar_vote_circular_v28_int8,
	.uses_rectifier_box = false,
	.xspi2_chip_offset = APP_AI_XSPI2_SCALAR_CHIP_OFFSET,
	.xspi2_base_addr = APP_AI_XSPI2_SCALAR_BASE_ADDR,
};

static const AppAI_ModelStageSpec app_ai_rectifier_stage = {
	.stage_label = "rectifier",
	.model_image_path = APP_AI_RECTIFIER_XSPI2_MODEL_IMAGE_PATH,
	.nn_instance = &NN_Instance_mobilenetv2_rectifier_hardcase_finetune,
	.network_init_fn =
		LL_ATON_EC_Network_Init_mobilenetv2_rectifier_hardcase_finetune,
	.inference_init_fn =
		LL_ATON_EC_Inference_Init_mobilenetv2_rectifier_hardcase_finetune,
	.uses_rectifier_box = true,
	.xspi2_chip_offset = APP_AI_XSPI2_RECTIFIER_CHIP_OFFSET,
	.xspi2_base_addr = APP_AI_XSPI2_RECTIFIER_BASE_ADDR,
};

