rishi-latchmepersad/embedded-gauge-reading-tinyml/firmware/stm32/n657/Appli/Src/app_ai.c
		(void)DebugConsole_Snprintf(line, sizeof(line),
					   "[AI] Input probe %s: x=%lu y=%lu rgb_milli=[%lu %lu %lu] rgb_bits=[0x%08lX 0x%08lX 0x%08lX]\r\n",
					   sample_labels[index], (unsigned long)sample_x,
					   (unsigned long)sample_y, r_milli, g_milli, b_milli,
					   (unsigned long)sample_bits[0U],
					   (unsigned long)sample_bits[1U],
					   (unsigned long)sample_bits[2U]);
		(void)DebugConsole_WriteString(line);
	}
}

/**
 * @brief Print a few evenly spaced samples from one tensor row.
 *
 * This makes it easier to see whether the row contains dial markings, the
 * needle, or only flat background after the crop/resample step.
 */
static void AppAI_LogTensorRowSamples(const char *label,
									  const float *input_buffer, size_t tensor_width, size_t row_y,
									  size_t x_min, size_t x_max)
{
	const size_t sample_count = 5U;
	size_t positions[5U] = {0U};

	if (!APP_AI_ENABLE_VERBOSE_CONSOLE_LOGS)
	{
		return;
	}

	if ((label == NULL) || (input_buffer == NULL) || (tensor_width == 0U) || (x_max <= x_min))
	{
		return;
	}

	{
		const size_t span = (x_max > x_min) ? (x_max - x_min - 1U) : 0U;
		positions[0U] = x_min;
		positions[1U] = x_min + (span / 4U);
		positions[2U] = x_min + (span / 2U);
		positions[3U] = x_min + ((span * 3U) / 4U);
		positions[4U] = (x_max > 0U) ? (x_max - 1U) : 0U;
	}

	DebugConsole_Printf("[AI] Row %s y=%lu:",
						label, (unsigned long)row_y);
	for (size_t index = 0U; index < sample_count; index++)
	{
		const size_t pixel_index = (row_y * tensor_width) + positions[index];
		const size_t base = pixel_index * 3U;
		const unsigned long r_milli =
			(unsigned long)(input_buffer[base + 0U] * 1000.0f + 0.5f);
		const unsigned long g_milli =
			(unsigned long)(input_buffer[base + 1U] * 1000.0f + 0.5f);
		const unsigned long b_milli =
			(unsigned long)(input_buffer[base + 2U] * 1000.0f + 0.5f);

		DebugConsole_Printf(" x=%lu rgb=[%lu %lu %lu]",
							(unsigned long)positions[index], r_milli, g_milli, b_milli);
	}
	DebugConsole_Printf("\r\n");
}

/**
 * @brief Print a compact luma patch from the source YUV422 frame.
 */
static void AppAI_LogSourcePatch(const char *label, const uint8_t *frame_bytes,
								 size_t frame_width_pixels, size_t center_x, size_t center_y,
								 size_t radius_pixels)
{
	const size_t x_min = (center_x > radius_pixels) ? (center_x - radius_pixels)
													: 0U;
	const size_t y_min = (center_y > radius_pixels) ? (center_y - radius_pixels)
													: 0U;
	const size_t x_max = ((center_x + radius_pixels) < APP_AI_CAPTURE_FRAME_WIDTH_PIXELS) ? (center_x + radius_pixels)
																						  : (APP_AI_CAPTURE_FRAME_WIDTH_PIXELS - 1U);
	const size_t y_max = ((center_y + radius_pixels) < APP_AI_CAPTURE_FRAME_HEIGHT_PIXELS) ? (center_y + radius_pixels)
																						   : (APP_AI_CAPTURE_FRAME_HEIGHT_PIXELS - 1U);

	if (!APP_AI_ENABLE_VERBOSE_CONSOLE_LOGS)
	{
		return;
	}

	if ((label == NULL) || (frame_bytes == NULL) || (frame_width_pixels == 0U))
	{
		return;
	}

	DebugConsole_Printf(
		"[AI] %s source patch center=(%lu,%lu) x=[%lu,%lu] y=[%lu,%lu]\r\n",
		label, (unsigned long)center_x, (unsigned long)center_y,
		(unsigned long)x_min, (unsigned long)x_max,
		(unsigned long)y_min, (unsigned long)y_max);

	for (size_t y = y_min; y <= y_max; ++y)
	{
		DebugConsole_Printf("[AI] %s y=%lu:", label, (unsigned long)y);
		for (size_t x = x_min; x <= x_max; ++x)
		{
			const uint8_t luma = AppAI_ReadYuv422Luma(frame_bytes, frame_size,
													  frame_width_pixels, x, y);
			const unsigned long luma_milli =
				(unsigned long)((luma * 1000U) / 255U);

			DebugConsole_Printf(" x=%lu=%lu", (unsigned long)x, luma_milli);
		}
		DebugConsole_Printf("\r\n");
	}
}

/**
 * @brief Print a compact tensor patch from the preprocessed input buffer.
 */
static void AppAI_LogTensorPatch(const char *label, const float *input_buffer,
								 size_t tensor_width, size_t center_x, size_t center_y,
								 size_t radius_pixels)
{
	const size_t x_min = (center_x > radius_pixels) ? (center_x - radius_pixels)
													: 0U;
	const size_t y_min = (center_y > radius_pixels) ? (center_y - radius_pixels)
													: 0U;
	const size_t x_max = ((center_x + radius_pixels) < tensor_width) ? (center_x + radius_pixels) : (tensor_width - 1U);
	const size_t y_max = ((center_y + radius_pixels) < APP_AI_CAPTURE_FRAME_HEIGHT_PIXELS) ? (center_y + radius_pixels)
																						   : (APP_AI_CAPTURE_FRAME_HEIGHT_PIXELS - 1U);

	if (!APP_AI_ENABLE_VERBOSE_CONSOLE_LOGS)
	{
		return;
	}

	if ((label == NULL) || (input_buffer == NULL) || (tensor_width == 0U))
	{
		return;
	}

	DebugConsole_Printf(
		"[AI] %s tensor patch center=(%lu,%lu) x=[%lu,%lu] y=[%lu,%lu]\r\n",
		label, (unsigned long)center_x, (unsigned long)center_y,
		(unsigned long)x_min, (unsigned long)x_max,
		(unsigned long)y_min, (unsigned long)y_max);

	for (size_t y = y_min; y <= y_max; ++y)
	{
		DebugConsole_Printf("[AI] %s y=%lu:", label, (unsigned long)y);
		for (size_t x = x_min; x <= x_max; ++x)
		{
			const size_t pixel_index = (y * tensor_width) + x;
			const size_t base = pixel_index * 3U;
			const unsigned long r_milli =
				(unsigned long)(input_buffer[base + 0U] * 1000.0f + 0.5f);
			const unsigned long g_milli =
				(unsigned long)(input_buffer[base + 1U] * 1000.0f + 0.5f);
			const unsigned long b_milli =
				(unsigned long)(input_buffer[base + 2U] * 1000.0f + 0.5f);

			DebugConsole_Printf(" x=%lu=[%lu %lu %lu]",
								(unsigned long)x, r_milli, g_milli, b_milli);
		}
		DebugConsole_Printf("\r\n");
	}
}

/**
 * @brief Print the source-crop luma that is being fed into resize/pad.
 *
 * This is the lowest-level image diagnostic in the pipeline. If these values
 * are already near zero, the problem is before tensor fill. If they are healthy
 * but the tensor is still zero, then the resize/write path is wrong.
 */
static void AppAI_LogSourceCropWindow(const uint8_t *frame_bytes,
									  size_t frame_size, size_t frame_width_pixels, size_t frame_height_pixels,
									  size_t crop_x_min, size_t crop_y_min, size_t crop_width,
									  size_t crop_height)
{
	const size_t center_x = crop_x_min + (crop_width / 2U);
	const size_t center_y = crop_y_min + (crop_height / 2U);
	const size_t window_radius = 8U;
	const size_t x_min = (center_x > window_radius) ? (center_x - window_radius)
													: crop_x_min;
	const size_t y_min = (center_y > window_radius) ? (center_y - window_radius)
													: crop_y_min;
	const size_t x_max = ((center_x + window_radius) < (crop_x_min + crop_width)) ? (center_x + window_radius) : (crop_x_min + crop_width);
	const size_t y_max = ((center_y + window_radius) < (crop_y_min + crop_height)) ? (center_y + window_radius) : (crop_y_min + crop_height);
	uint64_t sum_luma = 0U;
	uint8_t min_luma = 0xFFU;
	uint8_t max_luma = 0U;
	uint8_t center_luma = 0U;
	unsigned long center_luma_milli = 0U;
	unsigned long mean_luma_milli = 0U;
	unsigned long min_luma_milli = 0U;
	unsigned long max_luma_milli = 0U;
	size_t sample_count = 0U;

	if (!APP_AI_ENABLE_VERBOSE_CONSOLE_LOGS)
	{
		return;
	}

	if ((frame_bytes == NULL) || (frame_size < (frame_width_pixels * frame_height_pixels * 2U)))
	{
		return;
	}

	for (size_t y = y_min; y < y_max; ++y)
	{
		for (size_t x = x_min; x < x_max; ++x)
		{
			const uint8_t luma = AppAI_ReadYuv422Luma(frame_bytes, frame_size,
													  frame_width_pixels, x, y);

			if (luma < min_luma)
			{
				min_luma = luma;
			}
			if (luma > max_luma)
			{
				max_luma = luma;
			}
			sum_luma += (uint64_t)luma;
			sample_count++;
		}
	}

	center_luma = AppAI_ReadYuv422Luma(frame_bytes, frame_size,
									   center_x, center_y);

	if (sample_count == 0U)
	{
		return;
	}

	center_luma_milli = (unsigned long)((center_luma * 1000U) / 255U);
	mean_luma_milli = (unsigned long)(((sum_luma / sample_count) * 1000U) / 255U);
	min_luma_milli = (unsigned long)((min_luma * 1000U) / 255U);
	max_luma_milli = (unsigned long)((max_luma * 1000U) / 255U);

