rishi-latchmepersad/embedded-gauge-reading-tinyml/firmware/stm32/n657/Appli/Src/app_ai.c
		for (size_t x = APP_AI_GAUGE_CROP_BORDER_PIXELS;
			 x < (frame_width_pixels - APP_AI_GAUGE_CROP_BORDER_PIXELS); ++x)
		{
			const size_t pair_offset = row_offset + ((x & ~1U) * 2U);
			const size_t y_offset = pair_offset + (((x & 1U) != 0U) ? 2U : 0U);
			const uint8_t luma = frame_bytes[y_offset];

			if (luma < APP_AI_GAUGE_BRIGHT_THRESHOLD)
			{
				continue;
			}

			bright_count++;
			bright_sum_x += (uint64_t)x;
			bright_sum_y += (uint64_t)y;

			if (x < bright_x_min)
			{
				bright_x_min = x;
			}
			if (y < bright_y_min)
			{
				bright_y_min = y;
			}
			if (x > bright_x_max)
			{
				bright_x_max = x;
			}
			if (y > bright_y_max)
			{
				bright_y_max = y;
			}
		}
	}

	if (bright_count == 0U)
	{
		return false;
	}

	bright_center_x = (size_t)(bright_sum_x / (uint64_t)bright_count);
	bright_center_y = (size_t)(bright_sum_y / (uint64_t)bright_count);
	bbox_width = (bright_x_max - bright_x_min) + 1U;
	bbox_height = (bright_y_max - bright_y_min) + 1U;
	if ((bbox_width == 0U) || (bbox_height == 0U))
	{
		return false;
	}

	/* Anchor a slightly tighter crop on a shifted bright centroid instead of
	 * using the full bright bbox, which was pulling in too much background. */
	if (training_crop_width == 0U)
	{
		return false;
	}
	if (training_crop_height == 0U)
	{
		return false;
	}

	const size_t target_crop_width = (size_t)((((float)training_crop_width * (float)APP_AI_GAUGE_CROP_WIDTH_SCALE_NUMERATOR) / (float)APP_AI_GAUGE_CROP_WIDTH_SCALE_DENOMINATOR) + 0.5f);
	const size_t target_crop_height = (size_t)((((float)training_crop_height * (float)APP_AI_GAUGE_CROP_HEIGHT_SCALE_NUMERATOR) / (float)APP_AI_GAUGE_CROP_HEIGHT_SCALE_DENOMINATOR) + 0.5f);
	const size_t crop_width_pixels =
		(target_crop_width > 0U) ? target_crop_width : 1U;
	const size_t crop_height_pixels =
		(target_crop_height > 0U) ? target_crop_height : 1U;
	{
		const size_t y_bias_pixels = (size_t)(((float)crop_height_pixels * APP_AI_GAUGE_CROP_CENTER_Y_BIAS_RATIO) + 0.5f);
		const size_t bounded_y_bias =
			(y_bias_pixels < APP_AI_GAUGE_CROP_CENTER_Y_BIAS_MIN_PIXELS) ? APP_AI_GAUGE_CROP_CENTER_Y_BIAS_MIN_PIXELS
																		 : ((y_bias_pixels > APP_AI_GAUGE_CROP_CENTER_Y_BIAS_MAX_PIXELS) ? APP_AI_GAUGE_CROP_CENTER_Y_BIAS_MAX_PIXELS
																																		 : y_bias_pixels);

		biased_center_x = (bright_center_x > APP_AI_GAUGE_CROP_CENTER_X_BIAS_PIXELS) ? (bright_center_x - APP_AI_GAUGE_CROP_CENTER_X_BIAS_PIXELS) : 0U;
		biased_center_y = (bright_center_y > bounded_y_bias) ? (bright_center_y - bounded_y_bias) : 0U;
	}

	left = (biased_center_x > (crop_width_pixels / 2U)) ? (biased_center_x - (crop_width_pixels / 2U)) : 0U;
	top = (biased_center_y > (crop_height_pixels / 2U)) ? (biased_center_y - (crop_height_pixels / 2U)) : 0U;
	right = left + crop_width_pixels;
	bottom = top + crop_height_pixels;
	if (right > frame_width_pixels)
	{
		right = frame_width_pixels;
		left = (right > crop_width_pixels) ? (right - crop_width_pixels)
										   : 0U;
	}
	if (bottom > frame_height_pixels)
	{
		bottom = frame_height_pixels;
		top = (bottom > crop_height_pixels) ? (bottom - crop_height_pixels)
											: 0U;
	}

	if ((right <= left) || (bottom <= top))
	{
		return false;
	}

	*crop_x_min = left;
	*crop_y_min = top;
	*crop_width = right - left;
	*crop_height = bottom - top;

	if ((*crop_width < min_crop_width) || (*crop_height < min_crop_height))
	{
		return false;
	}

	return true;
}

static bool AppAI_LogXspi2ModelFilePrefix(FX_FILE *model_file_ptr)
{
	uint8_t source_bytes[APP_AI_XSPI2_PROBE_BYTES] = {0U};
	ULONG bytes_read = 0U;
	UINT fx_status = FX_SUCCESS;

	if (model_file_ptr == NULL)
	{
		return false;
	}

	fx_status = fx_file_read(model_file_ptr, source_bytes,
							 APP_AI_XSPI2_PROBE_BYTES, &bytes_read);
	if ((fx_status != FX_SUCCESS) || (bytes_read != APP_AI_XSPI2_PROBE_BYTES))
	{
		DebugConsole_Printf(
			"[AI] xSPI2 source prefix read failed (fx=%lu n=%lu).\r\n",
			(unsigned long)fx_status, (unsigned long)bytes_read);
		return false;
	}

	if (APP_AI_ENABLE_VERBOSE_CONSOLE_LOGS)
	{
		AppAI_LogXspi2PrefixBytes("xSPI2 source prefix:", source_bytes);
	}

	fx_status = fx_file_seek(model_file_ptr, 0U);
	if (fx_status != FX_SUCCESS)
	{
		DebugConsole_Printf(
			"[AI] xSPI2 source rewind failed (fx=%lu).\r\n",
			(unsigned long)fx_status);
		return false;
	}

	return true;
}

#if 0
static bool AppAI_Xspi2ModelImageMatchesFlash(void) {
	if (!AppAI_Xspi2ReadFlashProbe(APP_AI_XSPI2_SCALAR_CHIP_OFFSET, 0U,
			app_ai_xspi2_signature_start,
			sizeof(app_ai_xspi2_signature_start))) {
		DebugConsole_Printf("[AI] xSPI2 verify failed at start signature.\r\n");
		return false;
	}

	if ((app_ai_xspi2_programmed_size >= APP_AI_XSPI2_PROBE_BYTES)
			&& !AppAI_Xspi2ReadFlashProbe(APP_AI_XSPI2_SCALAR_CHIP_OFFSET,
					app_ai_xspi2_programmed_size - APP_AI_XSPI2_PROBE_BYTES,
					app_ai_xspi2_signature_tail,
					sizeof(app_ai_xspi2_signature_tail))) {
		DebugConsole_Printf("[AI] xSPI2 verify failed at tail signature.\r\n");
		return false;
	}

	return true;
}
#endif /* 0 */

static bool AppAI_Xspi2ModelImageMatchesMappedFlash(void)
{
	if (!AppAI_Xspi2ReadMappedProbe(0U, app_ai_xspi2_signature_start,
									sizeof(app_ai_xspi2_signature_start)))
	{
		DebugConsole_Printf(
			"[AI] xSPI2 mapped verify failed at start signature.\r\n");
		return false;
	}

	if ((app_ai_xspi2_programmed_size >= APP_AI_XSPI2_PROBE_BYTES) && !AppAI_Xspi2ReadMappedProbe(
																		  app_ai_xspi2_programmed_size - APP_AI_XSPI2_PROBE_BYTES,
																		  app_ai_xspi2_signature_tail,
																		  sizeof(app_ai_xspi2_signature_tail)))
	{
		DebugConsole_Printf(
			"[AI] xSPI2 mapped verify failed at tail signature.\r\n");
		return false;
	}

	return true;
}

static bool AppAI_Xspi2ModelImageMatchesMappedFlashForStage(
	const AppAI_ModelStageSpec *stage)
{
	const char *stage_label = NULL;
	bool is_rectifier;
	bool is_obb;

