rishi-latchmepersad/embedded-gauge-reading-tinyml/firmware/stm32/n657/Appli/Src/app_ai.c
	output_ptr = (const float *)LL_Buffer_addr_start(output_buffer_info);
	if ((output_ptr == NULL) || (LL_Buffer_len(output_buffer_info) < (sizeof(float) * 6U)))
	{
		return false;
	}

	if (!AppAI_IsFiniteFloat(output_ptr[0]) || !AppAI_IsFiniteFloat(output_ptr[1]) || !AppAI_IsFiniteFloat(output_ptr[2]) || !AppAI_IsFiniteFloat(output_ptr[3]) || !AppAI_IsFiniteFloat(output_ptr[4]) || !AppAI_IsFiniteFloat(output_ptr[5]))
	{
		DebugConsole_WriteString("[AI] OBB output contains non-finite values.\r\n");
		return false;
	}

#if APP_AI_ENABLE_RECTIFIER_DIAGNOSTICS
	DebugConsole_Printf(
		"[AI] OBB raw: cx=%.6f cy=%.6f w=%.6f h=%.6f cos=%.6f sin=%.6f\r\n",
		output_ptr[0], output_ptr[1], output_ptr[2], output_ptr[3],
		output_ptr[4], output_ptr[5]);
#endif

	center_x = AppAI_ClampNormalizedFloat(output_ptr[0]);
	center_y = AppAI_ClampNormalizedFloat(output_ptr[1]);
	box_w = AppAI_ClampNormalizedFloat(output_ptr[2]);
	box_h = AppAI_ClampNormalizedFloat(output_ptr[3]);
	if (box_w < APP_AI_OBB_MIN_BOX_RATIO)
	{
		box_w = APP_AI_OBB_MIN_BOX_RATIO;
	}
	else if (box_w > 1.0f)
	{
		box_w = 1.0f;
	}
	if (box_h < APP_AI_OBB_MIN_BOX_RATIO)
	{
		box_h = APP_AI_OBB_MIN_BOX_RATIO;
	}
	else if (box_h > 1.0f)
	{
		box_h = 1.0f;
	}

	angle_cos = output_ptr[4];
	angle_sin = output_ptr[5];
	theta_rad = 0.5f * atan2f(angle_sin, angle_cos);

	if (obb_box_out != NULL)
	{
		obb_box_out->center_x = center_x;
		obb_box_out->center_y = center_y;
		obb_box_out->box_w = box_w;
		obb_box_out->box_h = box_h;
		obb_box_out->angle_cos = angle_cos;
		obb_box_out->angle_sin = angle_sin;
		obb_box_out->theta_rad = theta_rad;
	}

	canvas_center_x = center_x * input_size_f;
	canvas_center_y = center_y * input_size_f;
	half_width = 0.5f * box_w * input_size_f * APP_AI_OBB_CROP_SCALE;
	half_height = 0.5f * box_h * input_size_f * APP_AI_OBB_CROP_SCALE;

	{
		const float cos_theta = cosf(theta_rad);
		const float sin_theta = sinf(theta_rad);
		const float corner_offsets[4][2] = {
			{-half_width, -half_height},
			{half_width, -half_height},
			{half_width, half_height},
			{-half_width, half_height},
		};
		float source_x_values[4] = {0.0f, 0.0f, 0.0f, 0.0f};
		float source_y_values[4] = {0.0f, 0.0f, 0.0f, 0.0f};

		for (size_t corner_index = 0U; corner_index < 4U; ++corner_index)
		{
			const float dx = corner_offsets[corner_index][0];
			const float dy = corner_offsets[corner_index][1];

			source_x_values[corner_index] = canvas_center_x + ((dx * cos_theta) - (dy * sin_theta));
			source_y_values[corner_index] = canvas_center_y + ((dx * sin_theta) + (dy * cos_theta));
		}

		crop_x_min_f = source_x_values[0U];
		crop_y_min_f = source_y_values[0U];
		crop_x_max_f = source_x_values[0U];
		crop_y_max_f = source_y_values[0U];
		for (size_t corner_index = 1U; corner_index < 4U; ++corner_index)
		{
			if (source_x_values[corner_index] < crop_x_min_f)
			{
				crop_x_min_f = source_x_values[corner_index];
			}
			if (source_y_values[corner_index] < crop_y_min_f)
			{
				crop_y_min_f = source_y_values[corner_index];
			}
			if (source_x_values[corner_index] > crop_x_max_f)
			{
				crop_x_max_f = source_x_values[corner_index];
			}
			if (source_y_values[corner_index] > crop_y_max_f)
			{
				crop_y_max_f = source_y_values[corner_index];
			}
		}
	}

	{
		const float crop_width_f = crop_x_max_f - crop_x_min_f;
		const float crop_height_f = crop_y_max_f - crop_y_min_f;
		const float crop_center_x_f = 0.5f * (crop_x_min_f + crop_x_max_f);
		const float crop_center_y_f = 0.5f * (crop_y_min_f + crop_y_max_f);
		const float target_width_f =
			(crop_width_f < APP_AI_OBB_MIN_CROP_SIZE_PIXELS)
				? APP_AI_OBB_MIN_CROP_SIZE_PIXELS
				: crop_width_f;
		const float target_height_f =
			(crop_height_f < APP_AI_OBB_MIN_CROP_SIZE_PIXELS)
				? APP_AI_OBB_MIN_CROP_SIZE_PIXELS
				: crop_height_f;

		crop_x_min_f = crop_center_x_f - (0.5f * target_width_f);
		crop_y_min_f = crop_center_y_f - (0.5f * target_height_f);
		crop_x_max_f = crop_x_min_f + target_width_f;
		crop_y_max_f = crop_y_min_f + target_height_f;
	}

	if (crop_x_min_f < 0.0f)
	{
		crop_x_max_f -= crop_x_min_f;
		crop_x_min_f = 0.0f;
	}
	if (crop_y_min_f < 0.0f)
	{
		crop_y_max_f -= crop_y_min_f;
		crop_y_min_f = 0.0f;
	}
	if (crop_x_max_f > source_width_f)
	{
		const float shift = crop_x_max_f - source_width_f;
		crop_x_min_f = (crop_x_min_f > shift) ? (crop_x_min_f - shift) : 0.0f;
		crop_x_max_f = source_width_f;
	}
	if (crop_y_max_f > source_height_f)
	{
		const float shift = crop_y_max_f - source_height_f;
		crop_y_min_f = (crop_y_min_f > shift) ? (crop_y_min_f - shift) : 0.0f;
		crop_y_max_f = source_height_f;
	}
	if (crop_x_min_f < 0.0f)
	{
		crop_x_min_f = 0.0f;
	}
	if (crop_y_min_f < 0.0f)
	{
		crop_y_min_f = 0.0f;
	}
	if (crop_x_max_f > source_width_f)
	{
		crop_x_max_f = source_width_f;
	}
	if (crop_y_max_f > source_height_f)
	{
		crop_y_max_f = source_height_f;
	}
	if ((crop_x_max_f <= crop_x_min_f) || (crop_y_max_f <= crop_y_min_f))
	{
		return false;
	}

	crop_out->x_min = (size_t)floorf(crop_x_min_f);
	crop_out->y_min = (size_t)floorf(crop_y_min_f);
	crop_out->width = (size_t)ceilf(crop_x_max_f) - crop_out->x_min;
	crop_out->height = (size_t)ceilf(crop_y_max_f) - crop_out->y_min;
	if (crop_out->width == 0U)
	{
		crop_out->width = 1U;
	}
	if (crop_out->height == 0U)
	{
		crop_out->height = 1U;
	}
	if (crop_out->x_min >= (size_t)APP_AI_CAPTURE_FRAME_WIDTH_PIXELS)
	{
		crop_out->x_min = (size_t)APP_AI_CAPTURE_FRAME_WIDTH_PIXELS - 1U;
	}
	if (crop_out->y_min >= (size_t)APP_AI_CAPTURE_FRAME_HEIGHT_PIXELS)
	{
		crop_out->y_min = (size_t)APP_AI_CAPTURE_FRAME_HEIGHT_PIXELS - 1U;
	}
	if ((crop_out->x_min + crop_out->width) > (size_t)APP_AI_CAPTURE_FRAME_WIDTH_PIXELS)
	{
		crop_out->width = (size_t)APP_AI_CAPTURE_FRAME_WIDTH_PIXELS - crop_out->x_min;
	}
	if ((crop_out->y_min + crop_out->height) > (size_t)APP_AI_CAPTURE_FRAME_HEIGHT_PIXELS)
	{
		crop_out->height = (size_t)APP_AI_CAPTURE_FRAME_HEIGHT_PIXELS - crop_out->y_min;
	}
	if ((crop_out->width == 0U) || (crop_out->height == 0U))
	{
		return false;
	}

	/* Keep the scalar crop inside the stable training-size family; if the OBB
	 * box is too tall or too wide, let the rectifier stage try instead. */
	{
		const float crop_width_ratio =
			((training_crop_width > 0U) ? ((float)crop_out->width / (float)training_crop_width) : 0.0f);
		const float crop_height_ratio =
			((training_crop_height > 0U) ? ((float)crop_out->height / (float)training_crop_height) : 0.0f);
		const long crop_width_ratio_milli =
			(long)(crop_width_ratio * 1000.0f + 0.5f);
		const long crop_height_ratio_milli =
			(long)(crop_height_ratio * 1000.0f + 0.5f);

		if ((crop_width_ratio < APP_AI_OBB_TRAINING_CROP_MIN_RATIO) || (crop_width_ratio > APP_AI_OBB_TRAINING_CROP_MAX_RATIO) || (crop_height_ratio < APP_AI_OBB_TRAINING_CROP_MIN_RATIO) || (crop_height_ratio > APP_AI_OBB_TRAINING_CROP_MAX_RATIO))
		{
			/* When the OBB crop is outside the training window, fall back to the
			 * exact fixed training crop geometry. The inner-dial center blending
			 * that was here before shifted the crop away from what the scalar
			 * model was trained on, causing large reading errors. */
			const AppGaugeGeometry_Crop_t fixed_crop = AppGaugeGeometry_TrainingCrop(
				(size_t)APP_AI_CAPTURE_FRAME_WIDTH_PIXELS,
				(size_t)APP_AI_CAPTURE_FRAME_HEIGHT_PIXELS);

