rishi-latchmepersad/embedded-gauge-reading-tinyml/firmware/stm32/n657/Appli/Src/app_ai.c
			DebugConsole_Printf(
				"[AI] OBB crop outside training window: crop=%lux%lu train=%lux%lu ratio=%ld/%ld -> fixed training crop fallback.\r\n",
				(unsigned long)crop_out->width,
				(unsigned long)crop_out->height,
				(unsigned long)training_crop_width,
				(unsigned long)training_crop_height,
				crop_width_ratio_milli, crop_height_ratio_milli);

			crop_out->x_min = fixed_crop.x_min;
			crop_out->y_min = fixed_crop.y_min;
			crop_out->width = fixed_crop.width;
			crop_out->height = fixed_crop.height;
		}
	}

	return true;
}
static void AppAI_LogSourceCropBoxResult(
	const LL_Buffer_InfoTypeDef *output_buffer_info,
	const AppAI_SourceCropBox *source_crop_box)
{
	if ((output_buffer_info == NULL) || (source_crop_box == NULL))
	{
		return;
	}
	DebugConsole_Printf(
		"[AI] Source-crop-box raw: x_min=%.6f y_min=%.6f x_max=%.6f y_max=%.6f\r\n",
		source_crop_box->x_min, source_crop_box->y_min,
		source_crop_box->x_max, source_crop_box->y_max);
}
static bool __attribute__((noinline)) AppAI_DecodeSourceCropBox(
	const LL_Buffer_InfoTypeDef *output_buffer_info,
	AppAI_SourceCrop *crop_out,
	AppAI_SourceCropBox *box_out)
{
	const float *output_ptr = NULL;
	const float source_width_f = (float)APP_AI_CAPTURE_FRAME_WIDTH_PIXELS;
	const float source_height_f = (float)APP_AI_CAPTURE_FRAME_HEIGHT_PIXELS;
	float x_min = 0.0f;
	float y_min = 0.0f;
	float x_max = 0.0f;
	float y_max = 0.0f;
	float crop_x_min_f = 0.0f;
	float crop_y_min_f = 0.0f;
	float crop_x_max_f = 0.0f;
	float crop_y_max_f = 0.0f;
	float crop_width_f = 0.0f;
	float crop_height_f = 0.0f;
	if ((output_buffer_info == NULL) || (crop_out == NULL))
	{
		return false;
	}
	output_ptr = (const float *)LL_Buffer_addr_start(output_buffer_info);
	if ((output_ptr == NULL) || (LL_Buffer_len(output_buffer_info) < (sizeof(float) * 4U)))
	{
		return false;
	}
	x_min = AppAI_ClampNormalizedFloat(output_ptr[0]);
	y_min = AppAI_ClampNormalizedFloat(output_ptr[1]);
	x_max = AppAI_ClampNormalizedFloat(output_ptr[2]);
	y_max = AppAI_ClampNormalizedFloat(output_ptr[3]);
	/* Ensure min <= max after clamping. */
	if (x_max < x_min)
	{
		const float tmp = x_min;
		x_min = x_max;
		x_max = tmp;
	}
	if (y_max < y_min)
	{
		const float tmp = y_min;
		y_min = y_max;
		y_max = tmp;
	}
	if (box_out != NULL)
	{
		box_out->x_min = x_min;
		box_out->y_min = y_min;
		box_out->x_max = x_max;
		box_out->y_max = y_max;
	}
	/* Convert normalized [0,1] to source pixel coordinates. */
	crop_x_min_f = x_min * source_width_f;
	crop_y_min_f = y_min * source_height_f;
	crop_x_max_f = x_max * source_width_f;
	crop_y_max_f = y_max * source_height_f;
	/* Clamp to frame bounds. */
	if (crop_x_min_f < 0.0f)
	{
		crop_x_min_f = 0.0f;
	}
	if (crop_y_min_f < 0.0f)
	{
		crop_y_min_f = 0.0f;
	}
	if (crop_x_max_f > source_width_f)
	{
		crop_x_max_f = source_width_f;
	}
	if (crop_y_max_f > source_height_f)
	{
		crop_y_max_f = source_height_f;
	}
	crop_width_f = crop_x_max_f - crop_x_min_f;
	crop_height_f = crop_y_max_f - crop_y_min_f;
	if ((crop_width_f < APP_AI_SOURCE_CROP_BOX_MIN_CROP_SIZE_PIXELS) ||
	    (crop_height_f < APP_AI_SOURCE_CROP_BOX_MIN_CROP_SIZE_PIXELS))
	{
		return false;
	}
	crop_out->x_min = (size_t)floorf(crop_x_min_f);
	crop_out->y_min = (size_t)floorf(crop_y_min_f);
	crop_out->width = (size_t)ceilf(crop_x_max_f) - crop_out->x_min;
	crop_out->height = (size_t)ceilf(crop_y_max_f) - crop_out->y_min;
	if (crop_out->width == 0U)
	{
		crop_out->width = 1U;
	}
	if (crop_out->height == 0U)
	{
		crop_out->height = 1U;
	}
	if (crop_out->x_min >= (size_t)APP_AI_CAPTURE_FRAME_WIDTH_PIXELS)
	{
		crop_out->x_min = (size_t)APP_AI_CAPTURE_FRAME_WIDTH_PIXELS - 1U;
	}
	if (crop_out->y_min >= (size_t)APP_AI_CAPTURE_FRAME_HEIGHT_PIXELS)
	{
		crop_out->y_min = (size_t)APP_AI_CAPTURE_FRAME_HEIGHT_PIXELS - 1U;
	}
	if ((crop_out->x_min + crop_out->width) > (size_t)APP_AI_CAPTURE_FRAME_WIDTH_PIXELS)
	{
		crop_out->width = (size_t)APP_AI_CAPTURE_FRAME_WIDTH_PIXELS - crop_out->x_min;
	}
	if ((crop_out->y_min + crop_out->height) > (size_t)APP_AI_CAPTURE_FRAME_HEIGHT_PIXELS)
	{
		crop_out->height = (size_t)APP_AI_CAPTURE_FRAME_HEIGHT_PIXELS - crop_out->y_min;
	}
	return true;
}

#if !defined(APP_AI_DISABLE_LEGACY_TOPK_DECODE)
static bool AppAI_DecodeScalarTopKExpectationFromOutput(
	const LL_Buffer_InfoTypeDef *output_info,
	const uint8_t *output_ptr,
	size_t output_len_bytes,
	float *decoded_value_out)
{
	size_t element_count = 0U;
	size_t topk = 0U;
	float top_logits[APP_AI_SCALAR_DECODE_TOPK];
	size_t top_indices[APP_AI_SCALAR_DECODE_TOPK];
	float scale_value = 1.0f;
	int16_t zero_point = 0;
	float max_logit = 0.0f;
	float weighted_fraction_sum = 0.0f;
	float weight_sum = 0.0f;
	float fraction = 0.0f;
	float decoded_value = 0.0f;
	size_t i = 0U;

	if ((output_info == NULL) || (output_ptr == NULL) || (decoded_value_out == NULL))
	{
		return false;
	}

	if (output_info->nbits <= 8U)
	{
		element_count = output_len_bytes;
		if (output_info->scale != NULL)
		{
			(void)memcpy(&scale_value, output_info->scale, sizeof(scale_value));
		}
		if (output_info->offset != NULL)
		{
			(void)memcpy(&zero_point, output_info->offset, sizeof(zero_point));
		}
	}
	else if (output_info->nbits == 32U)
	{
		element_count = output_len_bytes / sizeof(float);
	}
	else
	{
		return false;
	}

	if (element_count < 2U)
	{
		return false;
	}

	topk = (element_count < (size_t)APP_AI_SCALAR_DECODE_TOPK)
			   ? element_count
			   : (size_t)APP_AI_SCALAR_DECODE_TOPK;
	if (topk == 0U)
	{
		return false;
	}

	for (i = 0U; i < topk; ++i)
	{
		top_logits[i] = -INFINITY;
		top_indices[i] = 0U;
	}

	for (i = 0U; i < element_count; ++i)
	{
		float logit_value = 0.0f;
		size_t min_slot = 0U;
		size_t j = 0U;

		if (output_info->nbits <= 8U)
		{
			int32_t q_value = 0;
			if (output_info->Qunsigned != 0U)
			{
				q_value = (int32_t)output_ptr[i];
			}
			else
			{
				q_value = (int32_t)(*(const int8_t *)&output_ptr[i]);
			}
			logit_value =
				((float)q_value - (float)zero_point) * scale_value;
		}
		else
		{
			(void)memcpy(
				&logit_value,
				output_ptr + (i * sizeof(float)),
				sizeof(logit_value));
		}

		for (j = 1U; j < topk; ++j)
		{
			if (top_logits[j] < top_logits[min_slot])
			{
				min_slot = j;
			}
		}

		if (logit_value > top_logits[min_slot])
		{
			top_logits[min_slot] = logit_value;
			top_indices[min_slot] = i;
		}
	}

