rishi-latchmepersad/embedded-gauge-reading-tinyml/firmware/stm32/n657/Appli/Src/app_ai.c
#if APP_AI_BYPASS_SCALAR_INFERENCE
	if (stage == &app_ai_scalar_stage)
	{
		/* Keep the tensor fill path intact, but stop before model execution so
		 * we can isolate whether the stall is in preprocessing or in LL_ATON. */
		(void)DebugConsole_WriteString(
			"[AI] Scalar inference bypass active; returning after tensor fill.\r\n");
		if (output_info_out != NULL)
		{
			*output_info_out = output_info;
		}
		if (output_value_out != NULL)
		{
			*output_value_out = 0.0f;
		}
		AppAI_ClearForcedCrop();
		return true;
	}
#endif

	if (APP_AI_ENABLE_VERBOSE_CONSOLE_LOGS && (input_info->nbits > 8U))
	{
		DebugConsole_Printf(
			"[AI] %s preprocess complete; logging tensor signatures.\r\n",
			stage->stage_label);
		AppAI_LogFrameSignature(frame_bytes, frame_size);
		AppAI_LogInputSignature(input_ptr, input_float_count);
		AppAI_LogInputTensorWindow(input_ptr, input_float_count);
		AppAI_LogInputProbeSummary(input_ptr, input_float_count);
		AppAI_LogTensorPatch("Tensor center", input_ptr,
							 (size_t)APP_AI_CAPTURE_FRAME_WIDTH_PIXELS,
							 (size_t)APP_AI_CAPTURE_FRAME_WIDTH_PIXELS / 2U,
							 (size_t)APP_AI_CAPTURE_FRAME_HEIGHT_PIXELS / 2U, 2U);
	}

	if (emit_stage_diagnostics)
	{
		AppAI_LogBufferPreview("Stage input", input_info);
		(void)DebugConsole_WriteString("[AI] Stage input cache clean start.\r\n");
	}
	(void)mcu_cache_clean_range((uint32_t)(uintptr_t)input_ptr,
								(uint32_t)((uintptr_t)input_ptr + input_len_bytes));
	if (emit_stage_diagnostics)
	{
		(void)DebugConsole_WriteString("[AI] Stage input cache clean OK.\r\n");
	}

	/* Keep network reset opt-in. For this scalar package, forcing reset before
	 * every run can leave the output tensor in a constant invalid state even
	 * though the epoch loop reports DONE. */
	const bool force_reset_stage = (APP_AI_RESET_NETWORK_EACH_INFERENCE != 0);
	if (force_reset_stage)
	{
		if (emit_stage_diagnostics)
		{
			(void)DebugConsole_WriteString("[AI] Stage network reset start.\r\n");
		}
		LL_ATON_RT_Reset_Network(stage->nn_instance);
		if (emit_stage_diagnostics)
		{
			(void)DebugConsole_WriteString("[AI] Stage network reset OK.\r\n");
		}
	}
	else
	{
		if (emit_stage_diagnostics)
		{
			(void)DebugConsole_WriteString(
				"[AI] Stage network reset skipped (one-shot runtime).\r\n");
		}
	}

#if APP_AI_ENABLE_RUNTIME_METRICS
	/* Start metrics tracking for this inference */
	Metrics_StartInference("CNN");
#endif

	if (emit_stage_diagnostics && (stage == &app_ai_scalar_stage) && (LL_Buffer_addr_start(output_info) != NULL) &&
		(LL_Buffer_len(output_info) >= sizeof(uint32_t)))
	{
		uint32_t pre_output_bits = 0U;
		(void)memcpy(&pre_output_bits, LL_Buffer_addr_start(output_info),
					 sizeof(pre_output_bits));
		DebugConsole_Printf(
			"[AI] Scalar output pre-run bits=0x%08lX nbits=%lu Qm=%lu Qn=%lu Qu=%lu len=%lu\r\n",
			(unsigned long)pre_output_bits,
			(unsigned long)output_info->nbits,
			(unsigned long)output_info->Qm,
			(unsigned long)output_info->Qn,
			(unsigned long)output_info->Qunsigned,
			(unsigned long)LL_Buffer_len(output_info));
	}

	if (emit_stage_diagnostics)
	{
		(void)DebugConsole_WriteString("[AI] Stage inference run start.\r\n");
	}
	bool mid_logged = false;
	for (uint32_t epoch_step = 0U;; ++epoch_step)
	{
		/* Log mid-inference power after a few epochs (NPU active) */
		if (!mid_logged && epoch_step == 5U)
		{
#if APP_AI_ENABLE_RUNTIME_METRICS
			(void)INA219_LogReading("MID");
			Metrics_Checkpoint("MID");
#endif
			mid_logged = true;
		}

		const LL_ATON_RT_RetValues_t run_status =
			LL_ATON_RT_RunEpochBlock(stage->nn_instance);

		if (run_status == LL_ATON_RT_DONE)
		{
			break;
		}

		if (run_status == LL_ATON_RT_WFE)
		{
			LL_ATON_OSAL_WFE();
		}
		/* LL_ATON_RT_NO_WFE means the next epoch can start immediately, so
		 * keep the loop tight here and do not yield the thread. */
	}
	if (emit_stage_diagnostics)
	{
		(void)DebugConsole_WriteString("[AI] Stage inference run OK.\r\n");
	}

#if APP_AI_ENABLE_RUNTIME_METRICS
	/* Log post-inference power (peak during NPU activity) */
	(void)INA219_LogReading("POST");
	Metrics_Checkpoint("POST");
#endif

	output_ptr = (const uint8_t *)LL_Buffer_addr_start(output_info);
	output_len_bytes = (size_t)LL_Buffer_len(output_info);
	if (output_ptr == NULL)
	{
		AppAI_ClearForcedCrop();
		return false;
	}
	if ((output_info->nbits <= 8U) ? (output_len_bytes < 1U) : (output_len_bytes < sizeof(float)))
	{
		DebugConsole_Printf(
			"[AI] Stage output buffer too small: nbits=%lu len=%lu\r\n",
			(unsigned long)output_info->nbits,
			(unsigned long)output_len_bytes);
		AppAI_ClearForcedCrop();
		return false;
	}

	(void)mcu_cache_invalidate_range((uint32_t)(uintptr_t)output_ptr,
									 (uint32_t)((uintptr_t)output_ptr + output_len_bytes));

	if (emit_stage_diagnostics)
	{
		AppAI_LogBufferPreview("Stage output", output_info);
		AppAI_LogScalarInternalOutputProbe(stage, output_info);
	}

	/* Log raw output bytes immediately after cache invalidate so we can tell
	 * whether the inference engine populated the buffer at all. */
	{
		const uint8_t *ob = output_ptr;
		const size_t on = (output_len_bytes < 16U) ? output_len_bytes : 16U;
		char olog[128];
#if APP_AI_ENABLE_VERBOSE_CONSOLE_LOGS
		if (emit_stage_diagnostics)
		{
			(void)DebugConsole_Snprintf(olog, sizeof(olog),
					   "[AI] %s out addr=%p len=%lu bytes=[%02X%02X%02X%02X%02X%02X%02X%02X"
					   "%02X%02X%02X%02X%02X%02X%02X%02X]\r\n",
					   stage->stage_label, (const void *)output_ptr,
					   (unsigned long)output_len_bytes,
					   (on > 0U) ? ob[0] : 0U, (on > 1U) ? ob[1] : 0U,
					   (on > 2U) ? ob[2] : 0U, (on > 3U) ? ob[3] : 0U,
					   (on > 4U) ? ob[4] : 0U, (on > 5U) ? ob[5] : 0U,
					   (on > 6U) ? ob[6] : 0U, (on > 7U) ? ob[7] : 0U,
					   (on > 8U) ? ob[8] : 0U, (on > 9U) ? ob[9] : 0U,
					   (on > 10U) ? ob[10] : 0U, (on > 11U) ? ob[11] : 0U,
					   (on > 12U) ? ob[12] : 0U, (on > 13U) ? ob[13] : 0U,
					   (on > 14U) ? ob[14] : 0U, (on > 15U) ? ob[15] : 0U);
			(void)DebugConsole_WriteString(olog);
		}
#endif
	}

	/* Cache the output value before xSPI2 reconfiguration, because the
	 * internal buffer info pointers will become stale after reconfigure.
	 * V28 polar-vote model: decode 224 int8 logits via circular softmax.
	 * Fallback: single-scalar quantized decode for rectifier/OBB stages. */
	if (emit_stage_diagnostics && (stage == &app_ai_scalar_stage) &&
		AppAI_DecodeCircularVoteFromOutput(
			output_ptr,
			output_len_bytes,
			&output_value))
	{
		DebugConsole_Printf(
			"[AI] Scalar decode mode: circular_vote bins=%lu\r\n",
			(unsigned long)APP_AI_POLAR_VOTE_BINS);
	}
#if !defined(APP_AI_DISABLE_LEGACY_TOPK_DECODE)
	else if (emit_stage_diagnostics && (stage == &app_ai_scalar_stage) &&
			 AppAI_DecodeScalarTopKExpectationFromOutput(
				 output_info,
				 output_ptr,
				 output_len_bytes,
				 &output_value))
	{
		DebugConsole_Printf(
			"[AI] Scalar decode mode (legacy fallback): topk_expectation topk=%lu temp=%lu.%01lu bins=%lu\r\n",
			(unsigned long)APP_AI_SCALAR_DECODE_TOPK,
			(unsigned long)APP_AI_SCALAR_DECODE_TEMPERATURE,
			(unsigned long)((APP_AI_SCALAR_DECODE_TEMPERATURE * 10.0f)) % 10UL,
			(unsigned long)((output_info->nbits <= 8U)
							? output_len_bytes
							: (output_len_bytes / sizeof(float))));
	}
#endif /* !APP_AI_DISABLE_LEGACY_TOPK_DECODE */
	else if (emit_stage_diagnostics && (output_info->nbits <= 8U))
	{
		float scale_value = 1.0f;
		int16_t zero_point = 0;
		int32_t q_value = 0;
		char decode_line[96] = {0};

		if (output_info->scale != NULL)
		{
			(void)memcpy(&scale_value, output_info->scale, sizeof(scale_value));
		}
		if (output_info->offset != NULL)
		{
			(void)memcpy(&zero_point, output_info->offset, sizeof(zero_point));
		}

		if (output_info->Qunsigned != 0U)
		{
			q_value = (int32_t)(*output_ptr);
		}
		else
		{
			q_value = (int32_t)(*(const int8_t *)output_ptr);
		}

		output_value = ((float)q_value - (float)zero_point) * scale_value;
		(void)DebugConsole_Snprintf(decode_line, sizeof(decode_line),
				   "[AI] Stage output quantized decode: q=%ld zp=%ld nbits=%lu qu=%lu\r\n",
				   (long)q_value, (long)zero_point,
				   (unsigned long)output_info->nbits,
				   (unsigned long)output_info->Qunsigned);
		(void)DebugConsole_WriteString(decode_line);
	}
	else
	{
		(void)memcpy(&output_value, output_ptr, sizeof(output_value));
	}

	if (output_info_out != NULL)
	{
		*output_info_out = output_info;
	}
	if (output_value_out != NULL)
	{
		*output_value_out = output_value;
	}
	/* Guard scalar runtime handoff against corrupted tensor outputs. */
	if (emit_stage_diagnostics && (stage == &app_ai_scalar_stage))
	{
		if (!AppAI_IsFiniteFloat(output_value))
		{
			(void)DebugConsole_WriteString(
				"[AI] Scalar output invalid: non-finite value.\r\n");
			AppAI_ClearForcedCrop();
			return false;
		}
		if (!AppAI_IsPlausibleInferenceValue(output_value))
		{
			char scalar_warn_line[96];
			AppInferenceLog_FormatFloatMicros(
				scalar_warn_line, sizeof(scalar_warn_line),
				"[AI] Scalar output outside plausible range; continuing anyway: ",
				output_value);
			DebugConsole_WriteString(scalar_warn_line);
		}
	}

