rishi-latchmepersad/embedded-gauge-reading-tinyml/firmware/stm32/n657/Appli/Src/app_ai.c
	AppAI_LogXspi2PrefixBytes("xSPI2 prefix readback:", flash_bytes);
}

static void AppAI_LogXspi2MappedScaleBytes(void)
{
	if (app_ai_xspi2_programmed_size < 4U)
	{
		return;
	}
	const uint8_t *const tail_ptr = (const uint8_t *)(APP_AI_XSPI2_MODEL_BASE_ADDR + app_ai_xspi2_programmed_size - 4U);

	(void)mcu_cache_invalidate_range((uint32_t)(uintptr_t)tail_ptr,
									 (uint32_t)((uintptr_t)tail_ptr + 4U));

	DebugConsole_Printf(
		"[AI] xSPI2 mapped tail bytes @%p = %02X %02X %02X %02X\r\n",
		(const void *)tail_ptr, tail_ptr[0], tail_ptr[1], tail_ptr[2],
		tail_ptr[3]);
}

static void AppAI_LogXspi2IndirectAndMappedPrefix(void)
{
	uint8_t indirect_bytes[APP_AI_XSPI2_PROBE_BYTES] = {0U};
	uint8_t mapped_bytes[APP_AI_XSPI2_PROBE_BYTES] = {0U};
	const int32_t disable_status = BSP_XSPI_NOR_DisableMemoryMappedMode(0U);

	if (disable_status != BSP_ERROR_NONE)
	{
		DebugConsole_Printf(
			"[AI] xSPI2 disable-mapped before compare returned %ld.\r\n",
			(long)disable_status);
	}

	if (BSP_XSPI_NOR_Read(0U, indirect_bytes, 0U,
						  APP_AI_XSPI2_PROBE_BYTES) != BSP_ERROR_NONE)
	{
		DebugConsole_Printf("[AI] xSPI2 indirect prefix read failed.\r\n");
	}
	else
	{
		AppAI_LogXspi2PrefixBytes("xSPI2 indirect prefix:", indirect_bytes);
	}

	if (BSP_XSPI_NOR_EnableMemoryMappedMode(0U) != BSP_ERROR_NONE)
	{
		DebugConsole_Printf("[AI] xSPI2 re-enable mapped compare failed.\r\n");
		return;
	}

	(void)mcu_cache_invalidate_range(APP_AI_XSPI2_MODEL_BASE_ADDR,
									 APP_AI_XSPI2_MODEL_BASE_ADDR + APP_AI_XSPI2_PROBE_BYTES);
	(void)memcpy(mapped_bytes, (const void *)APP_AI_XSPI2_MODEL_BASE_ADDR,
				 APP_AI_XSPI2_PROBE_BYTES);
	AppAI_LogXspi2PrefixBytes("xSPI2 mapped prefix:", mapped_bytes);
}

static void AppAI_LogFloatApprox(const char *label, float value)
{
	union
	{
		float f;
		uint32_t u;
	} bits = {
		.f = value};
	unsigned long magnitude_whole = 0U;
	unsigned long magnitude_frac = 0U;
	const char *sign = "";
	double abs_value = 0.0;

	if (label == NULL)
	{
		return;
	}

	if ((bits.u & 0x7F800000U) == 0x7F800000U)
	{
		if ((bits.u & 0x007FFFFFU) != 0U)
		{
			DebugConsole_Printf("%sNaN\r\n", label);
		}
		else if ((bits.u & 0x80000000U) != 0U)
		{
			DebugConsole_Printf("%s-Inf\r\n", label);
		}
		else
		{
			DebugConsole_Printf("%s+Inf\r\n", label);
		}
		return;
	}

	if ((bits.u & 0x80000000U) != 0U)
	{
		sign = "-";
	}

	abs_value = (bits.u & 0x80000000U) != 0U ? -(double)value : (double)value;
	if (abs_value < 0.0)
	{
		abs_value = 0.0;
	}

	magnitude_whole = (unsigned long)abs_value;
	magnitude_frac = (unsigned long)((abs_value - (double)magnitude_whole) * 1000000.0 + 0.5);
	if (magnitude_frac >= 1000000U)
	{
		magnitude_whole++;
		magnitude_frac -= 1000000U;
	}

	DebugConsole_Printf("%s%s%lu.%06lu\r\n", label, sign,
						magnitude_whole, magnitude_frac);
}
#endif /* APP_AI_ENABLE_VERBOSE_CONSOLE_LOGS */

static float AppAI_TraceAndApplyInferenceCalibration(float raw_value)
{
	return AppInferenceCalibration_Apply(raw_value);
}

#if APP_AI_ENABLE_INFERENCE_BURST_SMOOTHING
/**
 * @brief Reset the tiny burst history used to stabilize the AI output.
 */
static void AppAI_ResetInferenceBurstHistory(void)
{
	(void)memset(app_ai_inference_burst_history, 0,
				 sizeof(app_ai_inference_burst_history));
	app_ai_inference_burst_history_count = 0U;
	app_ai_inference_burst_history_next_index = 0U;
}
#endif /* APP_AI_ENABLE_INFERENCE_BURST_SMOOTHING */

static bool AppAI_RuntimeInitStepwise(void)
{
	/* Let the vendor runtime perform the low-level ATON bring-up, OSAL setup,
	 * and IRQ wiring once ThreadX is alive. That matches the generated NPU
	 * sample flow more closely than open-coding the pieces by hand. */
	(void)DebugConsole_WriteString("[AI] ATON runtime init start.\r\n");
	LL_ATON_RT_SetRuntimeCallback(NULL);
	LL_ATON_RT_RuntimeInit();
	(void)DebugConsole_WriteString("[AI] ATON runtime init OK.\r\n");
	return true;
}

#if !APP_AI_ENABLE_VERBOSE_CONSOLE_LOGS
static void AppAI_LogXspi2FlashPrefix(void)
{
}

static void AppAI_LogXspi2MappedScaleBytes(void)
{
}

static void AppAI_LogXspi2IndirectAndMappedPrefix(void)
{
}

static void AppAI_LogFloatApprox(const char *label, float value)
{
	(void)label;
	(void)value;
}
#endif /* !APP_AI_ENABLE_VERBOSE_CONSOLE_LOGS */

static void AppAI_ConfigureNpuAccessControl(void)
{
	RIMC_MasterConfig_t npu_master = {0};

	/* Mirror the ST NPU examples so the runtime can access the cache and NPU
	 * control path with the expected secure/privileged attributes. */
	__HAL_RCC_RIFSC_CLK_ENABLE();
	__HAL_RCC_RISAF_CLK_ENABLE();
	__HAL_RCC_CACHEAXIRAM_MEM_CLK_ENABLE();

	/* The secure NPU validation app programs the NPU as secure + privileged.
	 * That matches our secure-side runtime more closely than the earlier NSEC
	 * experiment, and it avoids blocking the internal ATON control window. */
	npu_master.MasterCID = RIF_CID_1;
	npu_master.SecPriv = RIF_ATTRIBUTE_SEC | RIF_ATTRIBUTE_PRIV;
	HAL_RIF_RIMC_ConfigMasterAttributes(RIF_MASTER_INDEX_NPU, &npu_master);
	HAL_RIF_RISC_SetSlaveSecureAttributes(RIF_RISC_PERIPH_INDEX_NPU,
										  RIF_ATTRIBUTE_PRIV | RIF_ATTRIBUTE_SEC);

#if defined(RIF_RCC_PERIPH_INDEX_CACHEAXIRAM)
	HAL_RIF_RISC_SetSlaveSecureAttributes(RIF_RCC_PERIPH_INDEX_CACHEAXIRAM,
										  RIF_ATTRIBUTE_PRIV | RIF_ATTRIBUTE_SEC);
#endif

#if defined(RIF_RCC_PERIPH_INDEX_CACHECONFIG)
	HAL_RIF_RISC_SetSlaveSecureAttributes(RIF_RCC_PERIPH_INDEX_CACHECONFIG,
										  RIF_ATTRIBUTE_PRIV | RIF_ATTRIBUTE_SEC);
#endif
}

static void AppAI_EnableNpuMemoryAndCaches(void)
{
	/* Mirror the ST NPU examples so the memory fabric is actually usable by
	 * the runtime before the first ATON init call runs.  Enable ALL AXI SRAM
	 * banks that the ATON virtual memory pool (pool 11, spanning
	 * AXISRAM2-6) might touch.  Without AXISRAM2 the NPU's AXI master can
	 * fault at 0x00018800 when the runtime maps an activation buffer into
	 * the unmapped region. */
	RCC->MEMENR |= RCC_MEMENR_AXISRAM2EN | RCC_MEMENR_AXISRAM3EN | RCC_MEMENR_AXISRAM4EN | RCC_MEMENR_AXISRAM5EN | RCC_MEMENR_AXISRAM6EN | RCC_MEMENR_CACHEAXIRAMEN;

	RAMCFG_SRAM2_AXI->CR &= ~RAMCFG_CR_SRAMSD;
	RAMCFG_SRAM3_AXI->CR &= ~RAMCFG_CR_SRAMSD;
	RAMCFG_SRAM4_AXI->CR &= ~RAMCFG_CR_SRAMSD;
	RAMCFG_SRAM5_AXI->CR &= ~RAMCFG_CR_SRAMSD;
	RAMCFG_SRAM6_AXI->CR &= ~RAMCFG_CR_SRAMSD;

