rishi-latchmepersad/embedded-gauge-reading-tinyml/firmware/stm32/n657/Appli/Src/app_ai.c
	MEMSYSCTL->MSCR |= MEMSYSCTL_MSCR_DCACTIVE_Msk | MEMSYSCTL_MSCR_ICACTIVE_Msk;
}

static uint32_t AppAI_GetRisafMaxAddr(RISAF_TypeDef *risaf)
{
	uint32_t max_addr = 0U;

	if ((risaf == RISAF1_S) || (risaf == RISAF1_NS))
	{
		max_addr = RISAF1_LIMIT_ADDRESS_SPACE_SIZE;
	}
	else if ((risaf == RISAF2_S) || (risaf == RISAF2_NS))
	{
		max_addr = RISAF2_LIMIT_ADDRESS_SPACE_SIZE;
	}
	else if ((risaf == RISAF3_S) || (risaf == RISAF3_NS))
	{
		max_addr = RISAF3_LIMIT_ADDRESS_SPACE_SIZE;
	}
	else if ((risaf == RISAF4_S) || (risaf == RISAF4_NS))
	{
		max_addr = RISAF4_LIMIT_ADDRESS_SPACE_SIZE;
	}
	else if ((risaf == RISAF5_S) || (risaf == RISAF5_NS))
	{
		max_addr = RISAF5_LIMIT_ADDRESS_SPACE_SIZE;
	}
	else if ((risaf == RISAF6_S) || (risaf == RISAF6_NS))
	{
		max_addr = RISAF6_LIMIT_ADDRESS_SPACE_SIZE;
	}
	else if ((risaf == RISAF7_S) || (risaf == RISAF7_NS))
	{
		max_addr = RISAF7_LIMIT_ADDRESS_SPACE_SIZE;
	}
	else if ((risaf == RISAF8_S) || (risaf == RISAF8_NS))
	{
		max_addr = RISAF8_LIMIT_ADDRESS_SPACE_SIZE;
	}
	else if ((risaf == RISAF9_S) || (risaf == RISAF9_NS))
	{
		max_addr = RISAF9_LIMIT_ADDRESS_SPACE_SIZE;
	}
	else if ((risaf == RISAF11_S) || (risaf == RISAF11_NS))
	{
		max_addr = RISAF11_LIMIT_ADDRESS_SPACE_SIZE;
	}
	else if ((risaf == RISAF12_S) || (risaf == RISAF12_NS))
	{
		max_addr = RISAF12_LIMIT_ADDRESS_SPACE_SIZE;
	}
	else if ((risaf == RISAF13_S) || (risaf == RISAF13_NS))
	{
		max_addr = RISAF13_LIMIT_ADDRESS_SPACE_SIZE;
	}
	else if ((risaf == RISAF14_S) || (risaf == RISAF14_NS))
	{
		max_addr = RISAF14_LIMIT_ADDRESS_SPACE_SIZE;
	}
	else if ((risaf == RISAF15_S) || (risaf == RISAF15_NS))
	{
		max_addr = RISAF15_LIMIT_ADDRESS_SPACE_SIZE;
	}
	else if ((risaf == RISAF21_S) || (risaf == RISAF21_NS))
	{
		max_addr = RISAF21_LIMIT_ADDRESS_SPACE_SIZE;
	}
	else if ((risaf == RISAF22_S) || (risaf == RISAF22_NS))
	{
		max_addr = RISAF22_LIMIT_ADDRESS_SPACE_SIZE;
	}
	else if ((risaf == RISAF23_S) || (risaf == RISAF23_NS))
	{
		max_addr = RISAF23_LIMIT_ADDRESS_SPACE_SIZE;
	}

	return max_addr;
}

static void AppAI_SetRisafDefault(RISAF_TypeDef *risaf)
{
	RISAF_BaseRegionConfig_t risaf_conf;
	RISAF_TypeDef *const risaf_hw = (risaf == RISAF12_S) ? RISAF12_NS : risaf;

	risaf_conf.StartAddress = 0x0U;
	risaf_conf.EndAddress = AppAI_GetRisafMaxAddr(risaf_hw);
	risaf_conf.Filtering = RISAF_FILTER_ENABLE;
	risaf_conf.PrivWhitelist = RIF_CID_NONE;
	risaf_conf.ReadWhitelist = RIF_CID_MASK;
	risaf_conf.WriteWhitelist = RIF_CID_MASK;

	risaf_conf.Secure = RIF_ATTRIBUTE_SEC;
	if (risaf == RISAF12_S)
	{
	}
	HAL_RIF_RISAF_ConfigBaseRegion(risaf_hw, 0U, &risaf_conf);
	if (risaf == RISAF12_S)
	{
	}

	risaf_conf.Secure = RIF_ATTRIBUTE_NSEC;
	if (risaf == RISAF12_S)
	{
	}
	HAL_RIF_RISAF_ConfigBaseRegion(risaf_hw, 1U, &risaf_conf);
	if (risaf == RISAF12_S)
	{
	}
}

static void AppAI_ConfigureNpuRisafDefaults(void)
{
	/* Keep the default ST security model so the AI runtime can reach the memory
	 * and fabric regions it expects during LL_ATON startup. */
	__HAL_RCC_RIFSC_CLK_ENABLE();
	__HAL_RCC_RISAF_CLK_ENABLE();

	AppAI_SetRisafDefault(RISAF2_S);

	AppAI_SetRisafDefault(RISAF3_S);

	AppAI_SetRisafDefault(RISAF4_S);

	AppAI_SetRisafDefault(RISAF5_S);

	AppAI_SetRisafDefault(RISAF6_S);

	AppAI_SetRisafDefault(RISAF7_S);

	/* RISAF12 programming currently stalls on this board even though the
	 * xSPI2 memory-mapped window is already enabled. Leave it untouched for
	 * now so we can validate whether the runtime can proceed without it. */

#if defined(RISAF8_S) && defined(RISAF15_S)

	AppAI_SetRisafDefault(RISAF8_S);
	AppAI_SetRisafDefault(RISAF15_S);

#endif
}

bool App_AI_RunDryInferenceFromYuv422(const uint8_t *frame_bytes,
									  size_t frame_size)
{
	const uint8_t *safe_frame_bytes = frame_bytes;
	const LL_Buffer_InfoTypeDef *rectifier_output_info = NULL;
	const LL_Buffer_InfoTypeDef *obb_output_info = NULL;
	const LL_Buffer_InfoTypeDef *scalar_output_info = NULL;
	AppAI_RectifierBox rectifier_box = {0.0f, 0.0f, 0.0f, 0.0f};
	AppAI_ObbBox obb_box = {0.0f, 0.0f, 0.0f, 0.0f, 0.0f, 0.0f, 0.0f};
	AppAI_SourceCrop full_frame_crop = {0U, 0U,
										(size_t)APP_AI_CAPTURE_FRAME_WIDTH_PIXELS,
										(size_t)APP_AI_CAPTURE_FRAME_HEIGHT_PIXELS};
	const AppGaugeGeometry_Crop_t fixed_training_geometry =
		AppGaugeGeometry_TrainingCrop(
			(size_t)APP_AI_CAPTURE_FRAME_WIDTH_PIXELS,
			(size_t)APP_AI_CAPTURE_FRAME_HEIGHT_PIXELS);
	const AppAI_SourceCrop fixed_training_crop = {
		fixed_training_geometry.x_min,
		fixed_training_geometry.y_min,
		fixed_training_geometry.width,
		fixed_training_geometry.height,
	};
	AppAI_SourceCrop scalar_crop = {0U, 0U, 0U, 0U};
	bool scalar_crop_from_rectifier = false;
	bool scalar_crop_from_obb = false;
	bool scalar_crop_from_source_crop_box = false;
	float obb_output_value = 0.0f;
	float rectifier_output_value = 0.0f;
	float source_crop_box_output_value = 0.0f;
	float scalar_output_value = 0.0f;
	const LL_Buffer_InfoTypeDef *source_crop_box_output_info = NULL;
	AppAI_SourceCropBox source_crop_box = {0.0f, 0.0f, 0.0f, 0.0f};

	(void)DebugConsole_WriteString("[AI] Dry-run entry.\r\n");
	AppAI_LogR9("entry");
	if ((frame_bytes == NULL) || (frame_size < (size_t)APP_AI_CAPTURE_FRAME_BYTES))
	{
		(void)DebugConsole_WriteString("[AI] Dry-run entry aborted: invalid frame buffer.\r\n");
		return false;
	}

	memcpy(app_ai_dry_run_frame_scratch, frame_bytes, (size_t)APP_AI_CAPTURE_FRAME_BYTES);
	safe_frame_bytes = app_ai_dry_run_frame_scratch;

	if (!App_AI_Model_Init())
	{
		(void)DebugConsole_WriteString("[AI] Dry-run entry aborted during model init.\r\n");
		return false;
	}
	AppAI_LogR9("post_model_init");

#if APP_AI_ENABLE_TIP_FOCUS_GEOMETRY_STAGE
	/* =================================================================
	 * Tip-focus geometry heatmap: primary inference path.
	 * Preprocess YUV422 -> int8 RGB, run tip-focus model, decode
	 * heatmaps with local softargmax, calibrate angle->temperature,
	 * apply guardrails and median smoothing, then publish.
	 * Scalar inference runs below for diagnostic logging only.
	 * ================================================================= */
	{
		const uint32_t tf_fw = APP_AI_CAPTURE_FRAME_WIDTH_PIXELS;
		const uint32_t tf_fh = APP_AI_CAPTURE_FRAME_HEIGHT_PIXELS;
		int8_t *tf_input = NULL;
		const int8_t *tf_center_hm = NULL;
		const int8_t *tf_tip_hm = NULL;
		int8_t tf_conf_raw = 0;
		float tf_confidence = 0.0f;
		float tf_cx = NAN, tf_cy = NAN;
		float tf_tx = NAN, tf_ty = NAN;
		float tf_angle_deg = NAN;
		float tf_cw_dist = NAN;
		float tf_temperature = NAN;
		float tf_smoothed = 0.0f;
		bool tf_accepted = false;

		do /* one-shot try block */
		{
			if (!AppAI_TipFocus_Init())
			{
				DebugConsole_WriteString("[AI][TIP_FOCUS] Init failed.\r\n");
				break;
			}
			AppAI_LogR9("post_tip_focus_init");

