rishi-latchmepersad/embedded-gauge-reading-tinyml/firmware/stm32/n657/Appli/Src/app_ai.c
			tf_input = AppAI_TipFocus_GetInputBuffer();
			if (tf_input == NULL)
			{
				DebugConsole_WriteString("[AI][TIP_FOCUS] Input buffer unavailable after init.\r\n");
				break;
			}

			/* Use the rectifier localizer first so the crop can move with the
			 * camera. If that model cannot produce a plausible box, fall back to
			 * the older CPU luma heuristic and then the fixed training crop as a
			 * last resort.
			 *
			 * NOTE: The tip-focus model was trained on pre-cropped 112x112 images.
			 * The rectifier is an optional deployment aid. Set
			 * APP_AI_ENABLE_TIP_FOCUS_RECTIFIER=0 to skip it and use the fixed
			 * training crop directly, matching the training pipeline. */
			{
				bool crop_selected = false;

#if APP_AI_ENABLE_TIP_FOCUS_RECTIFIER
				{
					const float margin = 0.10f;
					const size_t frame_w = (size_t)tf_fw;
					const size_t frame_h = (size_t)tf_fh;
					const LL_Buffer_InfoTypeDef *rectifier_output_info = NULL;
					AppAI_RectifierBox rectifier_box = {0.0f, 0.0f, 0.0f, 0.0f};

					DebugConsole_WriteString(
						"[AI][TIP_FOCUS] Running rectifier localizer...\r\n");
					if (AppAI_RunStageInference(
							&app_ai_rectifier_stage, safe_frame_bytes, frame_size,
							&full_frame_crop, &rectifier_output_info,
							&rectifier_output_value) &&
						AppAI_DecodeRectifierCropBox(rectifier_output_info,
									 &scalar_crop, &rectifier_box))
					{
						const float cx =
							(float)scalar_crop.x_min + (float)scalar_crop.width * 0.5f;
						const float cy =
							(float)scalar_crop.y_min + (float)scalar_crop.height * 0.5f;
						const float expand_w =
							(float)scalar_crop.width * (1.0f + margin);
						const float expand_h =
							(float)scalar_crop.height * (1.0f + margin);
						float new_x = cx - expand_w * 0.5f;
						float new_y = cy - expand_h * 0.5f;
						float new_w = expand_w;
						float new_h = expand_h;

						AppAI_LogRectifierResult(rectifier_output_info,
									 &rectifier_box);

						if (new_x < 0.0f)
						{
							new_w += new_x;
							new_x = 0.0f;
						}
						if (new_y < 0.0f)
						{
							new_h += new_y;
							new_y = 0.0f;
						}
						if ((new_x + new_w) > (float)frame_w)
						{
							new_w = (float)frame_w - new_x;
						}
						if ((new_y + new_h) > (float)frame_h)
						{
							new_h = (float)frame_h - new_y;
						}
						if (new_w < 1.0f)
						{
							new_w = 1.0f;
						}
						if (new_h < 1.0f)
						{
							new_h = 1.0f;
						}

						scalar_crop.x_min = (size_t)floorf(new_x);
						scalar_crop.y_min = (size_t)floorf(new_y);
						scalar_crop.width = (size_t)floorf(new_w);
						scalar_crop.height = (size_t)floorf(new_h);

						AppAI_SetForcedCrop("rectifier", scalar_crop.x_min,
											scalar_crop.y_min, scalar_crop.width,
											scalar_crop.height);
						DebugConsole_Printf(
							"[AI][TIP_FOCUS] Rectifier adaptive crop: x=%lu y=%lu w=%lu h=%lu\r\n",
							(unsigned long)scalar_crop.x_min,
							(unsigned long)scalar_crop.y_min,
							(unsigned long)scalar_crop.width,
							(unsigned long)scalar_crop.height);
						crop_selected = true;
					}
					else
					{
						DebugConsole_WriteString(
							"[AI][TIP_FOCUS] Rectifier localizer failed; falling back to CPU luma heuristic.\r\n");
					}
				}
#else
				DebugConsole_WriteString(
					"[AI][TIP_FOCUS] Rectifier disabled; using CPU luma heuristic.\r\n");
#endif

				/* Use the fixed training crop for tip-focus, matching the
				 * offline training pipeline.  The heatmap model learns its own
				 * spatial attention, so the adaptive luma heuristic is not
				 * needed here. */
				AppAI_SetForcedCrop("training",
									fixed_training_crop.x_min,
									fixed_training_crop.y_min,
									fixed_training_crop.width,
									fixed_training_crop.height);
				DebugConsole_Printf(
					"[AI][TIP_FOCUS] Fixed training crop: x=%lu y=%lu w=%lu h=%lu\r\n",
					(unsigned long)fixed_training_crop.x_min,
					(unsigned long)fixed_training_crop.y_min,
					(unsigned long)fixed_training_crop.width,
					(unsigned long)fixed_training_crop.height);
				AppAI_LogR9("post_crop_select");

				/* Preprocess the frame through the training-aligned pipeline
				 * that applies the forced (or fallback) crop, resize-with-pad,
				 * and int8 quantisation. */
				{
					const LL_Buffer_InfoTypeDef *tf_input_info =
						(const LL_Buffer_InfoTypeDef *)AppAI_TipFocus_GetInputBufferInfo();
					const size_t required_bytes = (size_t)tf_fw * (size_t)tf_fh * 3U;

					DebugConsole_WriteString("[AI][TIP_FOCUS] Preprocessing YUV422 -> int8 RGB (crop + resize)...\r\n");
					if (!AppAI_PreprocessYuv422FrameToInt8Input(
							safe_frame_bytes, frame_size,
							(uint8_t *)tf_input, required_bytes,
							tf_input_info))
					{
						AppAI_ClearForcedCrop();
						DebugConsole_WriteString("[AI][TIP_FOCUS] Preprocessing failed.\r\n");
						break;
					}
				}
				AppAI_LogR9("post_preprocess");

				AppAI_ClearForcedCrop();

#if APP_AI_ENABLE_INNER_CELSIUS_MASK
				DebugConsole_WriteString("[AI][INNER_CELSIUS_MASK] Applying mask...\r\n");
				/* The mask was designed for 224x224 image space, but the
				 * tip-focus model input is 112x112.  Derive the actual model
				 * input dimension from the buffer info and scale the mask
				 * geometry accordingly. */
				{
					const LL_Buffer_InfoTypeDef *tf_input_info_mask =
						(const LL_Buffer_InfoTypeDef *)AppAI_TipFocus_GetInputBufferInfo();
					const size_t tf_input_bytes = (size_t)LL_Buffer_len(tf_input_info_mask);
					const size_t tf_input_dim = (size_t)(sqrtf((float)tf_input_bytes / 3.0f) + 0.5f);
					AppInnerCelsiusMask_Apply(tf_input, tf_input_dim, tf_input_dim);
				}
#endif /* APP_AI_ENABLE_INNER_CELSIUS_MASK */
				AppAI_LogR9("post_mask");
			}

			/* Run tip-focus inference */
			DebugConsole_WriteString("[AI][TIP_FOCUS] Running inference...\r\n");
			AppAI_LogR9("post_inference_console");
			if (!AppAI_TipFocus_Run())
			{
				DebugConsole_Printf("[AI][TIP_FOCUS] Inference run failed.\r\n");
				break;
			}

			/* Dequantize confidence and apply cheap pre-guardrail gate */
			tf_conf_raw = AppAI_TipFocus_GetConfidenceRaw();
			tf_confidence = ((float)tf_conf_raw + 128.0f) * 0.00390625f;
			if (tf_confidence < APP_AI_TIP_FOCUS_CONFIDENCE_FLOOR)
			{
				DebugConsole_Printf("[AI][TIP_FOCUS] Confidence %.3f < %.2f; rejecting.\r\n",
					tf_confidence, APP_AI_TIP_FOCUS_CONFIDENCE_FLOOR);
				break;
			}

