rishi-latchmepersad/embedded-gauge-reading-tinyml/firmware/stm32/n657/Appli/Src/app_ai.c
			/* Softargmax decode (local window w=3) on center and tip heatmaps */
			tf_center_hm = AppAI_TipFocus_GetCenterHeatmap();
			tf_tip_hm    = AppAI_TipFocus_GetTipHeatmap();
			if ((tf_center_hm == NULL) || (tf_tip_hm == NULL))
			{
				DebugConsole_WriteString("[AI][TIP_FOCUS] Heatmap pointers NULL.\r\n");
				break;
			}

			if (!AppAI_SoftArgmaxGlobal(tf_center_hm, (int32_t)APP_AI_TIP_FOCUS_HEATMAP_SIZE,
					&tf_cx, &tf_cy))
			{
				DebugConsole_WriteString("[AI][TIP_FOCUS] Center softargmax failed.\r\n");
				break;
			}
			if (!AppAI_SoftArgmaxGlobal(tf_tip_hm, (int32_t)APP_AI_TIP_FOCUS_HEATMAP_SIZE,
					&tf_tx, &tf_ty))
			{
				DebugConsole_WriteString("[AI][TIP_FOCUS] Tip softargmax failed.\r\n");
				break;
			}

			/* Compute angle (degrees, 0=3-o'clock, CW) from center -> tip vector */
			const float tf_dx = tf_tx - tf_cx;
			const float tf_dy = tf_ty - tf_cy;
			if ((fabsf(tf_dx) < 0.001f) && (fabsf(tf_dy) < 0.001f))
			{
				break;
			}

			tf_angle_deg = atan2f(tf_dy, tf_dx) * 180.0f / 3.14159265f;
			if (tf_angle_deg < 0.0f) { tf_angle_deg += 360.0f; }

			/* Calibrate: CW distance from cold reference -> temperature */
			if (tf_angle_deg >= APP_AI_TIP_FOCUS_COLD_ANGLE_DEG)
			{
				tf_cw_dist = tf_angle_deg - APP_AI_TIP_FOCUS_COLD_ANGLE_DEG;
			}
			else
			{
				tf_cw_dist = tf_angle_deg + 360.0f - APP_AI_TIP_FOCUS_COLD_ANGLE_DEG;
			}

			if ((tf_cw_dist < 0.0f) || (tf_cw_dist > APP_AI_TIP_FOCUS_SWEEP_DEG))
			{
				break;
			}

			tf_temperature = APP_AI_TIP_FOCUS_SLOPE * tf_cw_dist + APP_AI_TIP_FOCUS_INTERCEPT;

			if ((tf_temperature < APP_AI_TIP_FOCUS_TEMP_MIN_C) || (tf_temperature > APP_AI_TIP_FOCUS_TEMP_MAX_C))
			{
				break;
			}

			/* All guardrails passed: median-smooth and publish */
			tf_smoothed = AppAI_TipFocus_MedianFilter(tf_temperature);
			app_ai_last_inference_value = tf_smoothed;
			app_ai_last_inference_valid = true;
			app_ai_tip_focus_consecutive_invalid = 0U;
			app_ai_tip_focus_last_published = tf_smoothed;
			app_ai_tip_focus_last_published_valid = true;
			tf_accepted = true;

		} while (0);

		if (!tf_accepted)
		{
			app_ai_tip_focus_consecutive_invalid++;
		}

		{
			const char *tf_result_label;
			if (tf_accepted)
			{
				tf_result_label = "ACCEPT";
			}
			else if (app_ai_tip_focus_consecutive_invalid >= APP_AI_TIP_FOCUS_MAX_INVALID_FRAMES)
			{
				tf_result_label = "STALE";
			}
			else
			{
				tf_result_label = "HELD";
			}

			if (!tf_accepted)
			{
				/* Do not publish a held frame as a fresh inference result.
				 * Keep the last published value for internal smoothing, but
				 * force the shared result invalid so callers do not mistake a
				 * stale hold for a new reading. */
				app_ai_last_inference_value = app_ai_tip_focus_last_published;
				app_ai_last_inference_valid = false;
			}

			{
				char tf_status[128];
				char tf_cx_text[24];
				char tf_cy_text[24];
				char tf_tx_text[24];
				char tf_ty_text[24];
				char tf_conf_text[24];
				char tf_angle_text[24];
				char tf_temp_text[24];

				AppAI_FormatFixedFloat(tf_conf_text, sizeof(tf_conf_text),
					tf_confidence, 3U);
				AppAI_FormatFixedFloat(tf_cx_text, sizeof(tf_cx_text), tf_cx, 1U);
				AppAI_FormatFixedFloat(tf_cy_text, sizeof(tf_cy_text), tf_cy, 1U);
				AppAI_FormatFixedFloat(tf_tx_text, sizeof(tf_tx_text), tf_tx, 1U);
				AppAI_FormatFixedFloat(tf_ty_text, sizeof(tf_ty_text), tf_ty, 1U);
				AppAI_FormatFixedFloat(tf_angle_text, sizeof(tf_angle_text),
					tf_angle_deg, 1U);
				AppAI_FormatFixedFloat(tf_temp_text, sizeof(tf_temp_text),
					tf_temperature, 1U);
				(void)DebugConsole_Snprintf(tf_status, sizeof(tf_status),
					"[AI][TIP_FOCUS] STATUS: conf=%s center=(%s,%s) tip=(%s,%s) angle=%s temp=%s result=%s\r\n",
					tf_conf_text, tf_cx_text, tf_cy_text, tf_tx_text, tf_ty_text,
					tf_angle_text, tf_temp_text, tf_result_label);
				(void)DebugConsole_WriteString(tf_status);
			}
		}
	}
	/* Tip-focus is the primary path; skip the legacy scalar cascade entirely. */
	return true;
#endif /* APP_AI_ENABLE_TIP_FOCUS_GEOMETRY_STAGE */

#if APP_AI_ENABLE_SOURCE_CROP_BOX_STAGE
	(void)DebugConsole_WriteString(
		"[AI] Dry-run model init OK; launching source-crop-box stage.\r\n");

	if (AppAI_RunStageInference(&app_ai_source_crop_box_stage, safe_frame_bytes, frame_size,
								&full_frame_crop, &source_crop_box_output_info,
								&source_crop_box_output_value) &&
		AppAI_DecodeSourceCropBox(source_crop_box_output_info, &scalar_crop,
								 &source_crop_box))
	{
		AppAI_LogSourceCropBoxResult(source_crop_box_output_info, &source_crop_box);
		DebugConsole_Printf(
			"[AI] Source-crop-box crop: x=%lu y=%lu w=%lu h=%lu\r\n",
			(unsigned long)scalar_crop.x_min,
			(unsigned long)scalar_crop.y_min,
			(unsigned long)scalar_crop.width,
			(unsigned long)scalar_crop.height);
		DebugConsole_Printf(
			"[AI] Scalar stage using source-crop-box crop: x=%lu y=%lu w=%lu h=%lu\r\n",
			(unsigned long)scalar_crop.x_min,
			(unsigned long)scalar_crop.y_min,
			(unsigned long)scalar_crop.width,
			(unsigned long)scalar_crop.height);
		scalar_crop_from_source_crop_box = true;
	}
	else
#endif
	{
	#if APP_AI_ENABLE_SOURCE_CROP_BOX_STAGE
	(void)DebugConsole_WriteString(
			"[AI] Source-crop-box stage or decode failed; trying rectifier fallback.\r\n");
#else
	(void)DebugConsole_WriteString(
			"[AI] Source-crop-box skipped (disabled); trying rectifier fallback.\r\n");
#endif

	#if APP_AI_ENABLE_RECTIFIER_FALLBACK
		(void)DebugConsole_WriteString(
			"[AI] Dry-run model init OK; launching rectifier stage.\r\n");

		if (AppAI_RunStageInference(&app_ai_rectifier_stage, safe_frame_bytes, frame_size,
								&full_frame_crop, &rectifier_output_info,
								&rectifier_output_value) &&
			AppAI_DecodeRectifierCropBox(rectifier_output_info, &scalar_crop,
								 &rectifier_box))
		{
			AppAI_LogRectifierResult(rectifier_output_info, &rectifier_box);
			DebugConsole_Printf(
				"[AI] Rectifier crop: x=%lu y=%lu w=%lu h=%lu\r\n",
				(unsigned long)scalar_crop.x_min,
				(unsigned long)scalar_crop.y_min,
				(unsigned long)scalar_crop.width,
				(unsigned long)scalar_crop.height);
	#if !APP_AI_ENABLE_TIP_FOCUS_GEOMETRY_STAGE
			DebugConsole_Printf(
				"[AI] Scalar stage using rectifier crop: x=%lu y=%lu w=%lu h=%lu\r\n",
				(unsigned long)scalar_crop.x_min,
				(unsigned long)scalar_crop.y_min,
				(unsigned long)scalar_crop.width,
				(unsigned long)scalar_crop.height);
	#endif
			scalar_crop_from_rectifier = true;
		}
		else
	#endif
		{
	#if APP_AI_ENABLE_RECTIFIER_FALLBACK
			(void)DebugConsole_WriteString(
				"[AI] Rectifier stage or decode failed; trying OBB fallback.\r\n");
	#else
			(void)DebugConsole_WriteString(
				"[AI] Rectifier fallback disabled; trying OBB fallback.\r\n");
	#endif

