rishi-latchmepersad/embedded-gauge-reading-tinyml/firmware/stm32/n657/Appli/Src/app_ai.c
	#if APP_AI_ENABLE_OBB_STAGE != 0U
			(void)DebugConsole_WriteString("[AI] Dry-run model init OK; launching OBB fallback stage.\r\n");

			if (AppAI_RunStageInference(&app_ai_obb_stage, safe_frame_bytes, frame_size,
									&full_frame_crop, &obb_output_info, &obb_output_value) &&
				AppAI_DecodeObbCropBox(obb_output_info, &scalar_crop, &obb_box))
			{
				AppAI_LogObbResult(obb_output_info, &obb_box);
				DebugConsole_Printf(
					"[AI] OBB fallback crop: x=%lu y=%lu w=%lu h=%lu\r\n",
					(unsigned long)scalar_crop.x_min,
					(unsigned long)scalar_crop.y_min,
					(unsigned long)scalar_crop.width,
					(unsigned long)scalar_crop.height);
	#if !APP_AI_ENABLE_TIP_FOCUS_GEOMETRY_STAGE
				DebugConsole_Printf(
					"[AI] Scalar stage using OBB fallback crop: x=%lu y=%lu w=%lu h=%lu\r\n",
					(unsigned long)scalar_crop.x_min,
					(unsigned long)scalar_crop.y_min,
					(unsigned long)scalar_crop.width,
					(unsigned long)scalar_crop.height);
	#endif
				scalar_crop_from_obb = true;
			}
			else
	#endif
			{
				(void)DebugConsole_WriteString(
					"[AI] OBB fallback failed; using fixed training crop.\r\n");
			}
		}

	}
	if (!scalar_crop_from_rectifier && !scalar_crop_from_obb && !scalar_crop_from_source_crop_box)
	{
		scalar_crop = fixed_training_crop;
		DebugConsole_Printf(
			"[AI] Fixed training crop: x=%lu y=%lu w=%lu h=%lu\r\n",
			(unsigned long)scalar_crop.x_min,
			(unsigned long)scalar_crop.y_min,
			(unsigned long)scalar_crop.width,
			(unsigned long)scalar_crop.height);
#if !APP_AI_ENABLE_TIP_FOCUS_GEOMETRY_STAGE
		DebugConsole_Printf(
			"[AI] Scalar stage using fixed training crop: x=%lu y=%lu w=%lu h=%lu\r\n",
			(unsigned long)scalar_crop.x_min,
			(unsigned long)scalar_crop.y_min,
			(unsigned long)scalar_crop.width,
			(unsigned long)scalar_crop.height);
#endif
	}

#if APP_AI_BYPASS_SCALAR_STAGE_BEFORE_PREPROCESS
	if (scalar_crop_from_rectifier)
	{
		(void)DebugConsole_WriteString(
			"[AI] Scalar stage bypass active; skipping rectifier-crop handoff.\r\n");
	}
	else if (scalar_crop_from_obb)
	{
		(void)DebugConsole_WriteString(
			"[AI] Scalar stage bypass active; skipping OBB fallback handoff.\r\n");
	}
	else if (scalar_crop_from_source_crop_box)
	{
		(void)DebugConsole_WriteString(
			"[AI] Scalar stage bypass active; skipping source-crop-box handoff.\r\n");
	}
	else
	{
		(void)DebugConsole_WriteString(
			"[AI] Scalar stage bypass active; skipping fixed-crop handoff.\r\n");
	}
	app_ai_last_inference_valid = false;
	app_ai_last_inference_value = 0.0f;
	return true;
#else
#if APP_AI_BYPASS_SCALAR_INFERENCE
	if (scalar_crop_from_rectifier)
	{
#if !APP_AI_ENABLE_TIP_FOCUS_GEOMETRY_STAGE
		(void)DebugConsole_WriteString(
			"[AI] Scalar handoff active; rectifier-crop preprocess-only mode enabled.\r\n");
#endif
	}
	else if (scalar_crop_from_obb)
	{
#if !APP_AI_ENABLE_TIP_FOCUS_GEOMETRY_STAGE
		(void)DebugConsole_WriteString(
			"[AI] Scalar handoff active; OBB fallback preprocess-only mode enabled.\r\n");
#endif
	}
	else if (scalar_crop_from_source_crop_box)
	{
#if !APP_AI_ENABLE_TIP_FOCUS_GEOMETRY_STAGE
		(void)DebugConsole_WriteString(
			"[AI] Scalar handoff active; source-crop-box preprocess-only mode enabled.\r\n");
#endif
	}
	else
	{
#if !APP_AI_ENABLE_TIP_FOCUS_GEOMETRY_STAGE
		(void)DebugConsole_WriteString(
			"[AI] Scalar handoff active; preprocess-only mode enabled.\r\n");
#endif
	}
#else
	if (scalar_crop_from_rectifier)
	{
#if !APP_AI_ENABLE_TIP_FOCUS_GEOMETRY_STAGE
		(void)DebugConsole_WriteString(
			"[AI] Scalar handoff active; rectifier-crop scalar inference enabled.\r\n");
#endif
	}
	else if (scalar_crop_from_obb)
	{
#if !APP_AI_ENABLE_TIP_FOCUS_GEOMETRY_STAGE
		(void)DebugConsole_WriteString(
			"[AI] Scalar handoff active; OBB fallback scalar inference enabled.\r\n");
#endif
	}
	else if (scalar_crop_from_source_crop_box)
	{
#if !APP_AI_ENABLE_TIP_FOCUS_GEOMETRY_STAGE
		(void)DebugConsole_WriteString(
			"[AI] Scalar handoff active; source-crop-box crop scalar inference enabled.\r\n");
#endif
	}
	else
	{
#if !APP_AI_ENABLE_TIP_FOCUS_GEOMETRY_STAGE
		(void)DebugConsole_WriteString(
			"[AI] Scalar handoff active; full scalar inference enabled.\r\n");
#endif
	}
#endif
	if (!AppAI_RunStageInference(&app_ai_scalar_stage, safe_frame_bytes, frame_size,
								 &scalar_crop, &scalar_output_info, &scalar_output_value))
	{
		(void)DebugConsole_WriteString("[AI] Dry-run entry aborted during scalar stage.\r\n");
		return false;
	}

#if APP_AI_ENABLE_TIP_FOCUS_GEOMETRY_STAGE
	(void)scalar_output_value;
#else
	app_ai_last_inference_value =
		AppAI_TraceAndApplyInferenceCalibration(scalar_output_value);
	app_ai_last_inference_valid = true;
#endif

	return true;
#endif
}

/* USER CODE END 0 */

/* USER CODE BEGIN 1 */

static const LL_Buffer_InfoTypeDef *AppAI_GetInputBufferInfo(void)
{
	const LL_Buffer_InfoTypeDef *input_info =
		NN_Instance_polar_vote_circular_v28_int8.network
			->input_buffers_info();

	if ((input_info == NULL) || (input_info->name == NULL))
	{
		return NULL;
	}

	return input_info;
}

static const LL_Buffer_InfoTypeDef *AppAI_GetOutputBufferInfo(void)
{
	const LL_Buffer_InfoTypeDef *output_info =
		NN_Instance_polar_vote_circular_v28_int8.network
			->output_buffers_info();

	if ((output_info == NULL) || (output_info->name == NULL))
	{
		return NULL;
	}

	return output_info;
}

static const LL_Buffer_InfoTypeDef *AppAI_FindBufferInfoByName(
	const LL_Buffer_InfoTypeDef *buffer_list, const char *name)
{
	if ((buffer_list == NULL) || (name == NULL))
	{
		return NULL;
	}

	for (const LL_Buffer_InfoTypeDef *entry = buffer_list; entry->name != NULL;
		 ++entry)
	{
		if (strcmp(entry->name, name) == 0)
		{
			return entry;
		}
	}

	return NULL;
}

static const LL_Buffer_InfoTypeDef *AppAI_FindFirstBufferInfoByNames(
	const LL_Buffer_InfoTypeDef *buffer_list, const char *const *names,
	size_t name_count)
{
	if ((buffer_list == NULL) || (names == NULL) || (name_count == 0U))
	{
		return NULL;
	}

	for (size_t index = 0U; index < name_count; ++index)
	{
		const LL_Buffer_InfoTypeDef *buffer_info = AppAI_FindBufferInfoByName(
			buffer_list, names[index]);

