rishi-latchmepersad/embedded-gauge-reading-tinyml/firmware/stm32/n657/Appli/Src/app_ai.c
		if (buffer_info != NULL)
		{
			return buffer_info;
		}
	}

	return NULL;
}

static void AppAI_LogScalarInternalOutputProbe(
	const AppAI_ModelStageSpec *stage,
	const LL_Buffer_InfoTypeDef *stage_output_info)
{
	(void)stage;
	(void)stage_output_info;
}

#if APP_AI_ENABLE_VERBOSE_CONSOLE_LOGS
static void AppAI_LogInferenceResult(
	const LL_Buffer_InfoTypeDef *output_buffer_info)
{
	const LL_Buffer_InfoTypeDef *internal_buffers = NULL;
	const LL_Buffer_InfoTypeDef *quantize_output_info = NULL;
	const LL_Buffer_InfoTypeDef *sub_output_info = NULL;
	const LL_Buffer_InfoTypeDef *conv1_output_info = NULL;
	const LL_Buffer_InfoTypeDef *raw_output_info = NULL;
	const LL_Buffer_InfoTypeDef *scale_info = NULL;
	const LL_Buffer_InfoTypeDef *zero_point_info = NULL;
	union
	{
		float f;
		uint32_t u;
	} output_bits = {
		.f = 0.0f};
	float output_value = 0.0f;
	float head_scale = 1.0f;
	float output_dequant_scale = 1.0f;
	float head_dequant_value = 0.0f;
	int8_t raw_output_value = 0;
	int8_t head_zero_point = 0;
	int8_t output_zero_point = 0;
	static const char *const quantize_output_names[] = {
		"Sub_24_out_0",
		"Conv2D_25_zero_off_out_25",
	};
	static const char *const sub_output_names[] = {
		"Conv2D_25_zero_off_out_25",
		"Conv2D_30_zero_off_out_34",
	};
	static const char *const conv1_output_names[] = {
		"Conv2D_34_zero_off_out_43",
		"Conv2D_42_zero_off_out_61",
		"Conv2D_46_zero_off_out_70",
	};
	static const char *const raw_output_names[] = {
		"Quantize_261_out_0",
		"Quantize_390_out_0",
		"Gemm_271_out_0",
	};
	static const char *const scale_names[] = {
		"Dequantize_319_x_scale",
	};
	static const char *const zero_point_names[] = {
		"Dequantize_319_x_zero_point",
	};

	if (output_buffer_info == NULL)
	{
		DebugConsole_Printf("[AI] Inference failed: no output buffer.\r\n");
		return;
	}

	DebugConsole_Printf(
		"[AI] Output buffer meta: name=%s addr=%p len=%lu\r\n",
		(output_buffer_info->name != NULL) ? output_buffer_info->name : "(unnamed)",
		LL_Buffer_addr_start(output_buffer_info),
		(unsigned long)LL_Buffer_len(output_buffer_info));

	(void)memcpy(&output_bits.u, LL_Buffer_addr_start(output_buffer_info),
				 sizeof(output_bits.u));
	output_value = output_bits.f;

	internal_buffers =
		LL_ATON_Internal_Buffers_Info(
			&NN_Instance_polar_vote_circular_v28_int8);
	quantize_output_info = AppAI_FindFirstBufferInfoByNames(internal_buffers,
															quantize_output_names, sizeof(quantize_output_names) / sizeof(quantize_output_names[0]));
	sub_output_info = AppAI_FindFirstBufferInfoByNames(internal_buffers,
													   sub_output_names, sizeof(sub_output_names) / sizeof(sub_output_names[0]));
	conv1_output_info = AppAI_FindFirstBufferInfoByNames(internal_buffers,
														 conv1_output_names, sizeof(conv1_output_names) / sizeof(conv1_output_names[0]));
	raw_output_info = AppAI_FindFirstBufferInfoByNames(internal_buffers,
													   raw_output_names, sizeof(raw_output_names) / sizeof(raw_output_names[0]));
	scale_info = AppAI_FindFirstBufferInfoByNames(internal_buffers,
												  scale_names, sizeof(scale_names) / sizeof(scale_names[0]));
	zero_point_info = AppAI_FindFirstBufferInfoByNames(internal_buffers,
													   zero_point_names, sizeof(zero_point_names) / sizeof(zero_point_names[0]));

	if (APP_AI_ENABLE_VERBOSE_CONSOLE_LOGS)
	{
		AppAI_LogBufferInfoAndSignature("input tensor", quantize_output_info);
		AppAI_LogBufferInfoAndSignature("preprocess output", sub_output_info);
		AppAI_LogBufferInfoAndSignature("first conv", conv1_output_info);
		AppAI_LogBufferInfoAndSignature("raw head", raw_output_info);
		AppAI_LogBufferInfoAndSignature("network output", output_buffer_info);
	}

	/* Dump the first 16 raw bytes of both the head output and the final network
	 * output so we can tell whether the inference engine wrote anything at all
	 * and whether the int8 value being read is actually at offset 0. */
	if (APP_AI_ENABLE_VERBOSE_CONSOLE_LOGS && (raw_output_info != NULL) && (LL_Buffer_addr_start(raw_output_info) != NULL))
	{
		const uint8_t *p = (const uint8_t *)LL_Buffer_addr_start(raw_output_info);
		const size_t n = LL_Buffer_len(raw_output_info);
		DebugConsole_Printf(
			"[AI] Scalar raw-head bytes (len=%lu): "
			"[%02X %02X %02X %02X %02X %02X %02X %02X "
			"%02X %02X %02X %02X %02X %02X %02X %02X]\r\n",
			(unsigned long)n,
			(n > 0U) ? p[0] : 0U, (n > 1U) ? p[1] : 0U,
			(n > 2U) ? p[2] : 0U, (n > 3U) ? p[3] : 0U,
			(n > 4U) ? p[4] : 0U, (n > 5U) ? p[5] : 0U,
			(n > 6U) ? p[6] : 0U, (n > 7U) ? p[7] : 0U,
			(n > 8U) ? p[8] : 0U, (n > 9U) ? p[9] : 0U,
			(n > 10U) ? p[10] : 0U, (n > 11U) ? p[11] : 0U,
			(n > 12U) ? p[12] : 0U, (n > 13U) ? p[13] : 0U,
			(n > 14U) ? p[14] : 0U, (n > 15U) ? p[15] : 0U);
	}
	if (APP_AI_ENABLE_VERBOSE_CONSOLE_LOGS && (output_buffer_info != NULL) && (LL_Buffer_addr_start(output_buffer_info) != NULL))
	{
		const uint8_t *p = (const uint8_t *)LL_Buffer_addr_start(output_buffer_info);
		const size_t n = LL_Buffer_len(output_buffer_info);
		DebugConsole_Printf(
			"[AI] Scalar network-output bytes (len=%lu): "
			"[%02X %02X %02X %02X %02X %02X %02X %02X "
			"%02X %02X %02X %02X %02X %02X %02X %02X]\r\n",
			(unsigned long)n,
			(n > 0U) ? p[0] : 0U, (n > 1U) ? p[1] : 0U,
			(n > 2U) ? p[2] : 0U, (n > 3U) ? p[3] : 0U,
			(n > 4U) ? p[4] : 0U, (n > 5U) ? p[5] : 0U,
			(n > 6U) ? p[6] : 0U, (n > 7U) ? p[7] : 0U,
			(n > 8U) ? p[8] : 0U, (n > 9U) ? p[9] : 0U,
			(n > 10U) ? p[10] : 0U, (n > 11U) ? p[11] : 0U,
			(n > 12U) ? p[12] : 0U, (n > 13U) ? p[13] : 0U,
			(n > 14U) ? p[14] : 0U, (n > 15U) ? p[15] : 0U);
	}

	if ((raw_output_info != NULL) && (LL_Buffer_addr_start(raw_output_info) != NULL))
	{
		raw_output_value = *(const int8_t *)LL_Buffer_addr_start(raw_output_info);
	}

	{
		char raw_output_line[64] = {0};

		(void)DebugConsole_Snprintf(raw_output_line, sizeof(raw_output_line),
					   "[AI] Raw output int8: %d\r\n", (int)raw_output_value);
		DebugConsole_WriteString(raw_output_line);
	}

