rishi-latchmepersad/embedded-gauge-reading-tinyml/firmware/stm32/n657/Appli/Src/app_ai.c
	DebugConsole_Printf(
		"[AI] Raw tensor meta: name=%s addr=%p len=%lu\r\n",
		(raw_output_info != NULL) ? raw_output_info->name : "(missing)",
		(raw_output_info != NULL) ? (void *)LL_Buffer_addr_start(raw_output_info) : NULL,
		(raw_output_info != NULL) ? (unsigned long)LL_Buffer_len(raw_output_info) : 0UL);

	if ((scale_info != NULL) && (LL_Buffer_addr_start(scale_info) != NULL))
	{
		(void)memcpy(&output_dequant_scale, LL_Buffer_addr_start(scale_info),
					 sizeof(output_dequant_scale));
	}

	if ((zero_point_info != NULL) && (LL_Buffer_addr_start(zero_point_info) != NULL))
	{
		output_zero_point = *(const int8_t *)LL_Buffer_addr_start(
			zero_point_info);
	}

	if (raw_output_info != NULL)
	{
		const void *raw_output_addr = LL_Buffer_addr_start(raw_output_info);

		if (raw_output_addr != NULL)
		{
			raw_output_value = *(const int8_t *)raw_output_addr;
			if ((raw_output_info->scale != NULL) && (raw_output_info->offset != NULL))
			{
				(void)memcpy(&head_scale, raw_output_info->scale,
							 sizeof(head_scale));
				head_zero_point = *(const int16_t *)raw_output_info->offset;
			}
			head_dequant_value = ((float)raw_output_value - (float)head_zero_point) * head_scale;
		}
	}

	output_value = AppAI_TraceAndApplyInferenceCalibration(output_value);
	if (!AppAI_IsFiniteFloat(output_value))
	{
		AppAI_LogFloatApprox("[AI] Inference output value: ", output_value);
		DebugConsole_WriteString(
			"[AI] Inference result is non-finite; skipping smoothing and last-result update.\r\n");
		app_ai_last_inference_valid = false;
		return;
	}
	if (!AppAI_IsPlausibleInferenceValue(output_value))
	{
		AppAI_LogFloatApprox("[AI] Inference output value: ", output_value);
		DebugConsole_WriteString(
			"[AI] Inference result out of plausible range; skipping publish/update.\r\n");
		app_ai_last_inference_valid = false;
		return;
	}
#if APP_AI_ENABLE_INFERENCE_BURST_SMOOTHING
	output_value = AppAI_FilterInferenceValue(output_value);
#endif

	/* Log both the final float output and the raw int8 tensor so we can spot
	 * quantization mismatches without changing the model result path. */
	DebugConsole_Printf(
		"[AI] raw=%d head_zp=%d output_bits=0x%08lx output_zp=%d\r\n",
		(int)raw_output_value,
		(int)head_zero_point,
		(unsigned long)output_bits.u,
		(int)output_zero_point);
	if (APP_AI_ENABLE_VERBOSE_CONSOLE_LOGS)
	{
		AppAI_LogFloatApprox("[AI] head_scale: ", head_scale);
		AppAI_LogFloatApprox("[AI] head_dequant: ", head_dequant_value);
		AppAI_LogFloatApprox("[AI] output_scale: ", output_dequant_scale);
		AppAI_LogFloatApprox("[AI] output_zero_point: ",
							 (float)output_zero_point);
		AppAI_LogFloatApprox("[AI] Inference output value: ", output_value);
	}

	app_ai_last_inference_value = output_value;
	app_ai_last_inference_valid = true;
}
#else
static void AppAI_LogInferenceResult(
	const LL_Buffer_InfoTypeDef *output_buffer_info)
{
	float output_value = 0.0f;
	char line[64] = {0};

	if ((output_buffer_info == NULL) || (LL_Buffer_addr_start(output_buffer_info) == NULL) || (LL_Buffer_len(output_buffer_info) < sizeof(output_value)))
	{
		return;
	}

	(void)memcpy(&output_value, LL_Buffer_addr_start(output_buffer_info),
				 sizeof(output_value));
	output_value = AppAI_TraceAndApplyInferenceCalibration(output_value);
	if (!AppAI_IsFiniteFloat(output_value))
	{
		AppInferenceLog_FormatFloatMicros(line, sizeof(line),
										  "[AI] Inference value: ", output_value);
		DebugConsole_WriteString(line);
		AppInferenceLog_FormatFloatMicros(line, sizeof(line),
										  "[AI] Inference exact: ", output_value);
		DebugConsole_WriteString(line);
		DebugConsole_WriteString(
			"[AI] Inference result is non-finite; skipping smoothing and last-result update.\r\n");
		app_ai_last_inference_valid = false;
		return;
	}
	if (!AppAI_IsPlausibleInferenceValue(output_value))
	{
		AppInferenceLog_FormatFloatMicros(line, sizeof(line),
										  "[AI] Inference value: ", output_value);
		DebugConsole_WriteString(line);
		DebugConsole_WriteString(
			"[AI] Inference result out of plausible range; skipping smoothing and last-result update.\r\n");
		app_ai_last_inference_valid = false;
		return;
	}
#if APP_AI_ENABLE_INFERENCE_BURST_SMOOTHING
	output_value = AppAI_FilterInferenceValue(output_value);
#endif

	AppInferenceLog_FormatFloatMicros(line, sizeof(line),
									  "[AI] Inference value: ", output_value);
	DebugConsole_WriteString(line);

	app_ai_last_inference_value = output_value;
	app_ai_last_inference_valid = true;

#if APP_AI_ENABLE_RUNTIME_METRICS
	/* Log final power consumption and end metrics tracking */
	(void)INA219_LogReading("CNN-DONE");
	Metrics_EndInference(output_value);
#endif
}
#endif /* APP_AI_ENABLE_VERBOSE_CONSOLE_LOGS */

#if APP_AI_ENABLE_INFERENCE_BURST_SMOOTHING
/**
 * @brief Smooth the user-facing inference value across captures.
 *
 * A 3-frame burst median keeps the live reading from jumping on glare or a
 * single noisy capture while still tracking slow changes.
 */
static float AppAI_FilterInferenceValue(float value)
{
	float ordered[APP_AI_INFERENCE_BURST_HISTORY_SIZE] = {0.0f};
	size_t sample_count = 0U;
	size_t start_index = 0U;

	if (!AppAI_IsFiniteFloat(value))
	{
		if (app_ai_inference_burst_history_count > 0U)
		{
			const size_t last_index =
				(app_ai_inference_burst_history_next_index + APP_AI_INFERENCE_BURST_HISTORY_SIZE - 1U) % APP_AI_INFERENCE_BURST_HISTORY_SIZE;
			const float last_value =
				app_ai_inference_burst_history[last_index];

			if (AppAI_IsFiniteFloat(last_value))
			{
				return last_value;
			}
		}
		return value;
	}

	if (app_ai_inference_burst_history_count > 0U)
	{
		const size_t last_index =
			(app_ai_inference_burst_history_next_index + APP_AI_INFERENCE_BURST_HISTORY_SIZE - 1U) % APP_AI_INFERENCE_BURST_HISTORY_SIZE;
		float delta = value - app_ai_inference_burst_history[last_index];

		if (delta < 0.0f)
		{
			delta = -delta;
		}

		if (delta > APP_AI_INFERENCE_BURST_RESET_DELTA_C)
		{
			AppAI_ResetInferenceBurstHistory();
		}
	}

