rishi-latchmepersad/embedded-gauge-reading-tinyml/firmware/stm32/n657/Appli/Src/app_ai.c
	app_ai_inference_burst_history[app_ai_inference_burst_history_next_index] =
		value;
	if (app_ai_inference_burst_history_count <
		APP_AI_INFERENCE_BURST_HISTORY_SIZE)
	{
		app_ai_inference_burst_history_count++;
	}
	app_ai_inference_burst_history_next_index =
		(app_ai_inference_burst_history_next_index + 1U) % APP_AI_INFERENCE_BURST_HISTORY_SIZE;

	sample_count = app_ai_inference_burst_history_count;
	start_index = (sample_count < APP_AI_INFERENCE_BURST_HISTORY_SIZE) ? 0U
																	   : app_ai_inference_burst_history_next_index;

	for (size_t i = 0U; i < sample_count; ++i)
	{
		ordered[i] =
			app_ai_inference_burst_history[(start_index + i) % APP_AI_INFERENCE_BURST_HISTORY_SIZE];
	}

	/* Keep the local copy sorted so we can choose the median for the full
	 * 3-sample burst and a simple average during warm-up. */
	for (size_t i = 1U; i < sample_count; ++i)
	{
		const float key = ordered[i];
		size_t j = i;

		while ((j > 0U) && (ordered[j - 1U] > key))
		{
			ordered[j] = ordered[j - 1U];
			--j;
		}

		ordered[j] = key;
	}

	if (sample_count == 1U)
	{
		return ordered[0U];
	}

	if (sample_count == 2U)
	{
		return 0.5f * (ordered[0U] + ordered[1U]);
	}

	return ordered[sample_count / 2U];
}
#endif /* APP_AI_ENABLE_INFERENCE_BURST_SMOOTHING */

/**
 * @brief Return true only for ordinary finite float values.
 */
static bool AppAI_IsFiniteFloat(float value)
{
	union
	{
		float f;
		uint32_t u;
	} bits = {
		.f = value};

	return ((bits.u & 0x7F800000U) != 0x7F800000U);
}

/**
 * @brief Bound-check the calibrated scalar inference before publish/log.
 */
static bool AppAI_IsPlausibleInferenceValue(float value)
{
	if (!AppAI_IsFiniteFloat(value))
	{
		return false;
	}

	if (value < APP_AI_INFERENCE_VALUE_MIN_C)
	{
		return false;
	}

	if (value > APP_AI_INFERENCE_VALUE_MAX_C)
	{
		return false;
	}

	return true;
}

static int AppAI_ApplyCacheRange(uint32_t start_addr, uint32_t end_addr,
								 bool clean, bool invalidate)
{
	uintptr_t start = 0U;
	uintptr_t end = 0U;

	if (end_addr <= start_addr)
	{
		return -1;
	}

	start = (uintptr_t)start_addr;
	end = (uintptr_t)end_addr;

	start &= ~((uintptr_t)APP_AI_CACHE_LINE_BYTES - 1U);
	end = (end + APP_AI_CACHE_LINE_BYTES - 1U) & ~((uintptr_t)APP_AI_CACHE_LINE_BYTES - 1U);

	if (clean)
	{
		SCB_CleanDCache_by_Addr((uint32_t *)start, (int32_t)(end - start));
	}

	if (invalidate)
	{
		SCB_InvalidateDCache_by_Addr((uint32_t *)start,
									 (int32_t)(end - start));
	}

return 0;
}

static uint8_t AppAI_ReadYuv422Luma(const uint8_t *frame_bytes,
									size_t frame_size_bytes,
									size_t frame_width_pixels, size_t source_x, size_t source_y);

static float AppAI_ReadNormalizedGrayFromYuv422Bilinear(
	const uint8_t *frame_bytes, size_t frame_size_bytes,
	size_t frame_width_pixels, size_t frame_height_pixels,
	float source_x, float source_y)
{
	/* Add additional bounds checking */
	if ((frame_bytes == NULL) || (frame_size_bytes < 4U) ||
		(frame_width_pixels == 0U) || (frame_height_pixels == 0U))
	{
		DebugConsole_Printf("[AI] ReadNormalizedGrayFromYuv422Bilinear: Invalid parameters\r\n");
		return 0.0f;
	}

	/* Add bounds checking for source coordinates */
	if (source_x < 0.0f || source_y < 0.0f)
	{
		DebugConsole_Printf("[AI] ReadNormalizedGrayFromYuv422Bilinear: Negative coordinates: x=%f, y=%f\r\n", 
						   (double)source_x, (double)source_y);
		source_x = (source_x < 0.0f) ? 0.0f : source_x;
		source_y = (source_y < 0.0f) ? 0.0f : source_y;
	}

	const float max_x = (frame_width_pixels > 0U) ? (float)(frame_width_pixels - 1U)
												 : 0.0f;
	const float max_y = (frame_height_pixels > 0U) ? (float)(frame_height_pixels - 1U)
												  : 0.0f;

	/* Add additional bounds checking for max values */
	if (max_x < 0.0f || max_y < 0.0f)
	{
		DebugConsole_Printf("[AI] ReadNormalizedGrayFromYuv422Bilinear: Invalid max values: max_x=%f, max_y=%f\r\n", 
						   (double)max_x, (double)max_y);
		return 0.0f;
	}

	float clamped_x = source_x;
	float clamped_y = source_y;

	if (clamped_x > max_x)
	{
		clamped_x = max_x;
	}

	if (clamped_y > max_y)
	{
		clamped_y = max_y;
	}

	/* Add additional validation for clamped coordinates */
	if (clamped_x < 0.0f || clamped_y < 0.0f)
	{
		DebugConsole_Printf("[AI] ReadNormalizedGrayFromYuv422Bilinear: Clamped coordinates negative: x=%f, y=%f\r\n", 
						   (double)clamped_x, (double)clamped_y);
		return 0.0f;
	}

	const size_t x0 = (size_t)floorf(clamped_x);
	const size_t y0 = (size_t)floorf(clamped_y);
	
	/* Add bounds checking for x0 and y0 */
	if (x0 >= frame_width_pixels || y0 >= frame_height_pixels)
	{
		DebugConsole_Printf("[AI] ReadNormalizedGrayFromYuv422Bilinear: x0/y0 out of bounds: x0=%lu, y0=%lu, width=%lu, height=%lu\r\n", 
						   (unsigned long)x0, (unsigned long)y0, 
						   (unsigned long)frame_width_pixels, (unsigned long)frame_height_pixels);
		return 0.0f;
	}

	const size_t x1 = (x0 + 1U < frame_width_pixels) ? (x0 + 1U) : x0;
	const size_t y1 = (y0 + 1U < frame_height_pixels) ? (y0 + 1U) : y0;
	const float fx = clamped_x - (float)x0;
	const float fy = clamped_y - (float)y0;
	
	/* Add bounds checking for fx and fy */
	if (fx < 0.0f || fx > 1.0f || fy < 0.0f || fy > 1.0f)
	{
		DebugConsole_Printf("[AI] ReadNormalizedGrayFromYuv422Bilinear: Invalid fx/fy: fx=%f, fy=%f\r\n", 
						   (double)fx, (double)fy);
	}

	/* Add bounds checking for AppAI_ReadYuv422Luma calls */
	const uint8_t luma00 = AppAI_ReadYuv422Luma(frame_bytes, frame_size_bytes,
												frame_width_pixels, x0, y0);
	const uint8_t luma10 = AppAI_ReadYuv422Luma(frame_bytes, frame_size_bytes,
												frame_width_pixels, x1, y0);
	const uint8_t luma01 = AppAI_ReadYuv422Luma(frame_bytes, frame_size_bytes,
												frame_width_pixels, x0, y1);
	const uint8_t luma11 = AppAI_ReadYuv422Luma(frame_bytes, frame_size_bytes,
												frame_width_pixels, x1, y1);
	const float l00 = (float)luma00 / 255.0f;
	const float l10 = (float)luma10 / 255.0f;
	const float l01 = (float)luma01 / 255.0f;
	const float l11 = (float)luma11 / 255.0f;
	const float top = l00 + (fx * (l10 - l00));
	const float bottom = l01 + (fx * (l11 - l01));
	const float gray = top + (fy * (bottom - top));

	/* Add bounds checking for final gray value */
	if (gray < 0.0f)
	{
		return 0.0f;
	}

	if (gray > 1.0f)
	{
		return 1.0f;
	}

	return gray;
}

static bool __attribute__((noinline)) AppAI_PreprocessScalarRow(
	const uint8_t *frame_bytes, size_t frame_size, size_t source_width,
	size_t source_height, size_t crop_x_min, size_t crop_y_min,
	size_t crop_width, size_t crop_height, size_t output_width,
	size_t output_height, float resize_scale, size_t resized_width,
	size_t resized_height, size_t resize_pad_x, size_t resize_pad_y,
	size_t out_y, float *input_ptr, size_t input_len_bytes)
{
	/* Add bounds checking for parameters */
	if ((frame_bytes == NULL) || (input_ptr == NULL) || (source_width == 0) || (source_height == 0))
	{
		DebugConsole_Printf("[AI] PreprocessScalarRow: Invalid parameters\r\n");
		return false;
	}

#if APP_AI_YUV422_INPUT_LUMA_ONLY
	if ((out_y < resize_pad_y) || (out_y >= (resize_pad_y + resized_height)))
	{
		return true;
	}
#endif

	const size_t row_len = output_width * 3U * sizeof(float);
	const size_t row_offset = (out_y * output_width) * 3U * sizeof(float);
	
	/* Add additional bounds checking for row_offset */
	if (row_offset >= input_len_bytes)
	{
		DebugConsole_Printf("[AI] PreprocessScalarRow: row_offset out of bounds: %lu >= %lu\r\n", 
						   (unsigned long)row_offset, (unsigned long)input_len_bytes);
		return false;
	}
	
