rishi-latchmepersad/embedded-gauge-reading-tinyml/firmware/stm32/n657/Appli/Src/app_ai.c
	/* Add additional bounds checking for row_len */
	if ((row_offset + row_len) > input_len_bytes)
	{
		DebugConsole_Printf("[AI] PreprocessScalarRow: row_len out of bounds: %lu + %lu > %lu\r\n", 
						   (unsigned long)row_offset, (unsigned long)row_len, (unsigned long)input_len_bytes);
		return false;
	}
	
	uint8_t *const row_bytes = (uint8_t *)input_ptr + row_offset;

	if ((row_bytes == NULL) || (frame_bytes == NULL))
	{
		DebugConsole_Printf("[AI] PreprocessScalarRow: NULL pointer detected\r\n");
		return false;
	}
	if ((row_offset + row_len) > input_len_bytes)
	{
		DebugConsole_Printf("[AI] PreprocessScalarRow: Buffer overflow detected\r\n");
		return false;
	}

	for (size_t out_x = 0U; out_x < output_width; out_x++)
	{
		/* Add bounds checking for out_x */
		if (out_x >= output_width)
		{
			DebugConsole_Printf("[AI] PreprocessScalarRow: out_x out of bounds: %lu >= %lu\r\n", 
							   (unsigned long)out_x, (unsigned long)output_width);
			return false;
		}
		
#if APP_AI_YUV422_INPUT_LUMA_ONLY
		const size_t pixel_base = out_x * 3U * sizeof(float);
		
		/* Add bounds checking for pixel_base */
		if ((pixel_base + 11U) >= (output_width * 3U * sizeof(float)))
		{
			DebugConsole_Printf("[AI] PreprocessScalarRow: pixel_base out of bounds: %lu >= %lu\r\n", 
							   (unsigned long)(pixel_base + 11U), (unsigned long)(output_width * 3U * sizeof(float)));
			return false;
		}
		
		uint32_t gray_bits = 0U;

		if ((out_x >= resize_pad_x) &&
			(out_x < (resize_pad_x + resized_width)))
		{
			const size_t resized_x = out_x - resize_pad_x;
			const size_t resized_y = out_y - resize_pad_y;
			size_t sample_x = crop_x_min + ((resized_x * crop_width) / resized_width);
			size_t sample_y = crop_y_min + ((resized_y * crop_height) / resized_height);

			/* Clamp the nearest-neighbor sample point to the crop bounds. */
			if (sample_x >= (crop_x_min + crop_width))
			{
				sample_x = crop_x_min + crop_width - 1U;
			}
			if (sample_y >= (crop_y_min + crop_height))
			{
				sample_y = crop_y_min + crop_height - 1U;
			}

			/* Read the luma sample directly so the hot row loop stays in the
			 * lightweight nearest-neighbor path. */
			const size_t source_index =
				(((sample_y * source_width) + (sample_x & ~1U)) * 2U) +
				((sample_x & 1U) ? 2U : 0U);
			const uint8_t gray = frame_bytes[source_index];

			{
				union
				{
					float f;
					uint32_t u;
				} gray_value = {
					.f = ((float)gray) / 255.0f};
				gray_bits = gray_value.u;
			}
		}
		{
			const uint8_t *const gray_bytes = (const uint8_t *)&gray_bits;

			/* Write the float bytes one at a time so the compiler cannot turn the
			 * store into an alignment-sensitive wide access on this board. */
			row_bytes[pixel_base + 0U] = gray_bytes[0];
			row_bytes[pixel_base + 1U] = gray_bytes[1];
			row_bytes[pixel_base + 2U] = gray_bytes[2];
			row_bytes[pixel_base + 3U] = gray_bytes[3];

			row_bytes[pixel_base + 4U] = gray_bytes[0];
			row_bytes[pixel_base + 5U] = gray_bytes[1];
			row_bytes[pixel_base + 6U] = gray_bytes[2];
			row_bytes[pixel_base + 7U] = gray_bytes[3];

			row_bytes[pixel_base + 8U] = gray_bytes[0];
			row_bytes[pixel_base + 9U] = gray_bytes[1];
			row_bytes[pixel_base + 10U] = gray_bytes[2];
			row_bytes[pixel_base + 11U] = gray_bytes[3];
		}
#else
	if ((out_y < resize_pad_y) || (out_y >= (resize_pad_y + resized_height)))
	{
		/* Add bounds checking for memset */
		const size_t memset_len = output_width * 3U * sizeof(float);
		if ((row_offset + memset_len) <= input_len_bytes)
		{
			(void)memset(row_bytes, 0, memset_len);
		}
		else
		{
			DebugConsole_Printf("[AI] PreprocessScalarRow: memset would overflow buffer\r\n");
		}
		return true;
	}

	const size_t pixel_base = out_x * 3U * sizeof(float);
	
	/* Add bounds checking for pixel_base */
	if ((pixel_base + 11U) >= (output_width * 3U * sizeof(float)))
	{
		DebugConsole_Printf("[AI] PreprocessScalarRow: pixel_base out of bounds: %lu >= %lu\r\n", 
						   (unsigned long)(pixel_base + 11U), (unsigned long)(output_width * 3U * sizeof(float)));
		return false;
	}
	
	float out_r_bits = 0.0f;
	float out_g_bits = 0.0f;
	float out_b_bits = 0.0f;

		if ((out_x >= resize_pad_x) &&
			(out_x < (resize_pad_x + resized_width)))
		{
			const float resized_x = (float)(out_x - resize_pad_x);
			const float resized_y = (float)(out_y - resize_pad_y);
			float crop_x = ((resized_x + 0.5f) / resize_scale) - 0.5f;
			float crop_y = ((resized_y + 0.5f) / resize_scale) - 0.5f;

			/* Add bounds checking for crop coordinates */
			if (crop_x < 0.0f)
			{
				crop_x = 0.0f;
			}
			else if (crop_x > (float)(crop_width - 1U))
			{
				crop_x = (float)(crop_width - 1U);
			}

			if (crop_y < 0.0f)
			{
				crop_y = 0.0f;
			}
			else if (crop_y > (float)(crop_height - 1U))
			{
				crop_y = (float)(crop_height - 1U);
			}

			/* Add bounds checking for crop_x_min and crop_y_min */
			const float total_crop_x = (float)crop_x_min + crop_x;
			const float total_crop_y = (float)crop_y_min + crop_y;
			
			if (total_crop_x >= 0.0f && total_crop_x < (float)source_width &&
				total_crop_y >= 0.0f && total_crop_y < (float)source_height)
			{
				AppAI_ReadRgbFromYuv422Bilinear(
					frame_bytes, frame_size, source_width, source_height,
					total_crop_x, total_crop_y,
					&out_r_bits, &out_g_bits, &out_b_bits);
			}
			else
			{
				DebugConsole_Printf("[AI] PreprocessScalarRow: Crop coordinates out of bounds: x=%f, y=%f\r\n", 
								   (double)total_crop_x, (double)total_crop_y);
				out_r_bits = 0.0f;
				out_g_bits = 0.0f;
				out_b_bits = 0.0f;
			}
		}

		out_r_bits = AppAI_ClampNormalizedFloat(out_r_bits);
		out_g_bits = AppAI_ClampNormalizedFloat(out_g_bits);
		out_b_bits = AppAI_ClampNormalizedFloat(out_b_bits);
		{
			const uint8_t *const r_bytes = (const uint8_t *)&out_r_bits;
			const uint8_t *const g_bytes = (const uint8_t *)&out_g_bits;
			const uint8_t *const b_bytes = (const uint8_t *)&out_b_bits;

			row_bytes[pixel_base + 0U] = r_bytes[0];
			row_bytes[pixel_base + 1U] = r_bytes[1];
			row_bytes[pixel_base + 2U] = r_bytes[2];
			row_bytes[pixel_base + 3U] = r_bytes[3];

			row_bytes[pixel_base + 4U] = g_bytes[0];
			row_bytes[pixel_base + 5U] = g_bytes[1];
			row_bytes[pixel_base + 6U] = g_bytes[2];
			row_bytes[pixel_base + 7U] = g_bytes[3];

			row_bytes[pixel_base + 8U] = b_bytes[0];
			row_bytes[pixel_base + 9U] = b_bytes[1];
			row_bytes[pixel_base + 10U] = b_bytes[2];
			row_bytes[pixel_base + 11U] = b_bytes[3];
		}
#endif
	}

