rishi-latchmepersad/embedded-gauge-reading-tinyml/firmware/stm32/n657/Appli/Src/app_ai.c
	return true;
}

static bool __attribute__((noinline)) AppAI_PreprocessYuv422FrameToFloatInput(
	const uint8_t *frame_bytes, size_t frame_size, float *input_ptr,
	size_t input_float_count, size_t input_len_bytes)
{
	/* Add additional bounds checking and validation */
	if ((frame_bytes == NULL) || (input_ptr == NULL))
	{
		DebugConsole_Printf("[AI] PreprocessYuv422FrameToFloatInput: NULL pointers\r\n");
		return false;
	}

	const size_t source_width = (size_t)APP_AI_CAPTURE_FRAME_WIDTH_PIXELS;
	const size_t source_height = (size_t)APP_AI_CAPTURE_FRAME_HEIGHT_PIXELS;

	/* Add additional validation for source dimensions */
	if (source_width == 0U || source_height == 0U)
	{
		DebugConsole_Printf("[AI] PreprocessYuv422FrameToFloatInput: Invalid source dimensions: width=%lu, height=%lu\r\n", 
						   (unsigned long)source_width, (unsigned long)source_height);
		return false;
	}

	/* Minimum 3-channel float input (224*224*3) for RGB models like OBB.
	 * The scalar model uses 7-channel int8 via the polar path, so this
	 * float path only runs for non-scalar stages with nbits > 8. */
	const size_t min_float_count = (size_t)APP_AI_CAPTURE_FRAME_WIDTH_PIXELS * (size_t)APP_AI_CAPTURE_FRAME_HEIGHT_PIXELS * 3U;
	const size_t min_float_bytes = min_float_count * sizeof(float);
	if ((frame_size < (size_t)APP_AI_CAPTURE_FRAME_BYTES) ||
		(input_float_count < min_float_count) ||
		(input_len_bytes < min_float_bytes))
	{
		DebugConsole_Printf("[AI] PreprocessYuv422FrameToFloatInput: Buffer size mismatch: frame_size=%lu, input_float_count=%lu, input_len_bytes=%lu\r\n", 
						   (unsigned long)frame_size, (unsigned long)input_float_count, (unsigned long)input_len_bytes);
		return false;
	}

	/* Add additional validation for expected frame size */
	const size_t expected_frame_size = source_width * source_height * APP_AI_CAPTURE_FRAME_BYTES_PER_PIXEL;
	if (frame_size != expected_frame_size)
	{
		DebugConsole_Printf("[AI] PreprocessYuv422FrameToFloatInput: Frame size mismatch: expected=%lu, actual=%lu\r\n", 
						   (unsigned long)expected_frame_size, (unsigned long)frame_size);
		/* Continue processing but log the mismatch */
	}

	size_t crop_x_min = 0U;
	size_t crop_y_min = 0U;
	size_t crop_width = source_width;
	size_t crop_height = source_height;
	bool crop_found = false;
	const char *crop_label = "fixed";

	/* DCMIPP_PIXEL_PACKER_FORMAT_YUV422_1 emits packed YUYV samples:
	 *   byte 0 = Y0, byte 1 = U, byte 2 = Y1, byte 3 = V, ...
	 * We estimate the gauge position from the bright dial face, crop around
	 * that box, and then map the crop into the model input tensor. */
	if (app_ai_forced_crop_active)
	{
		crop_found = true;
		crop_label = (app_ai_forced_crop_label != NULL)
						 ? app_ai_forced_crop_label
						 : "forced";
		crop_x_min = app_ai_forced_crop_x_min;
		crop_y_min = app_ai_forced_crop_y_min;
		crop_width = app_ai_forced_crop_width;
		crop_height = app_ai_forced_crop_height;
		
		/* Add bounds checking for forced crop */
		if (crop_x_min >= source_width || crop_y_min >= source_height)
		{
			DebugConsole_Printf("[AI] PreprocessYuv422FrameToFloatInput: Forced crop origin out of bounds: x=%lu, y=%lu, width=%lu, height=%lu\r\n", 
							   (unsigned long)crop_x_min, (unsigned long)crop_y_min, 
							   (unsigned long)source_width, (unsigned long)source_height);
			crop_x_min = 0U;
			crop_y_min = 0U;
			crop_width = source_width;
			crop_height = source_height;
		}
		
		if ((crop_x_min + crop_width) > source_width)
		{
			crop_width = source_width - crop_x_min;
		}
		
		if ((crop_y_min + crop_height) > source_height)
		{
			crop_height = source_height - crop_y_min;
		}
	}
	else
	{
#if APP_AI_USE_ADAPTIVE_GAUGE_CROP
		crop_found = AppAI_EstimateGaugeCropBoxFromYuv422(frame_bytes, frame_size,
														  source_width, source_height, &crop_x_min, &crop_y_min,
														  &crop_width, &crop_height);
		
		/* Add bounds checking for adaptive crop */
		if (crop_found)
		{
			if (crop_x_min >= source_width || crop_y_min >= source_height)
			{
				DebugConsole_Printf("[AI] PreprocessYuv422FrameToFloatInput: Adaptive crop origin out of bounds: x=%lu, y=%lu, width=%lu, height=%lu\r\n", 
								   (unsigned long)crop_x_min, (unsigned long)crop_y_min, 
								   (unsigned long)source_width, (unsigned long)source_height);
				crop_found = false;
			}
			else
			{
				if ((crop_x_min + crop_width) > source_width)
				{
					crop_width = source_width - crop_x_min;
				}
				
				if ((crop_y_min + crop_height) > source_height)
				{
					crop_height = source_height - crop_y_min;
				}
				
				if (crop_width == 0U || crop_height == 0U)
				{
					crop_found = false;
				}
			}
		}
#endif
		if (crop_found)
		{
			crop_label = "adaptive";
		}
	}
	
	if (!crop_found)
	{
		crop_x_min = (size_t)((float)source_width * APP_AI_TRAINING_CROP_X_MIN_RATIO);
		crop_y_min = (size_t)((float)source_height * APP_AI_TRAINING_CROP_Y_MIN_RATIO);
		crop_width = (size_t)((float)source_width * (APP_AI_TRAINING_CROP_X_MAX_RATIO - APP_AI_TRAINING_CROP_X_MIN_RATIO));
		crop_height = (size_t)((float)source_height * (APP_AI_TRAINING_CROP_Y_MAX_RATIO - APP_AI_TRAINING_CROP_Y_MIN_RATIO));
		if (crop_width == 0U)
		{
			crop_width = 1U;
		}
		if (crop_height == 0U)
		{
			crop_height = 1U;
		}
		
		/* Add bounds checking for default crop */
		if (crop_x_min >= source_width)
		{
			crop_x_min = source_width - 1U;
		}
		if (crop_y_min >= source_height)
		{
			crop_y_min = source_height - 1U;
		}
		if ((crop_x_min + crop_width) > source_width)
		{
			crop_width = source_width - crop_x_min;
		}
		if ((crop_y_min + crop_height) > source_height)
		{
			crop_height = source_height - crop_y_min;
		}
	}

	/* Clamp the crop before we hand it to the resize path.
	 * The scalar reader expects a crop that stays inside the captured frame,
	 * and clamping here makes the preprocessing path resilient even if a future
	 * crop heuristic overshoots by a pixel. */
	if (crop_x_min >= source_width)
	{
		crop_x_min = source_width - 1U;
		crop_width = 1U;
	}
	if (crop_y_min >= source_height)
	{
		crop_y_min = source_height - 1U;
		crop_height = 1U;
	}
	if ((crop_x_min + crop_width) > source_width)
	{
		crop_width = source_width - crop_x_min;
	}
	if ((crop_y_min + crop_height) > source_height)
	{
		crop_height = source_height - crop_y_min;
	}

