rishi-latchmepersad/embedded-gauge-reading-tinyml/firmware/stm32/n657/Appli/Src/app_ai.c
	/* Add additional validation for final crop dimensions */
	if (crop_width == 0U || crop_height == 0U)
	{
		DebugConsole_Printf("[AI] PreprocessYuv422FrameToFloatInput: Invalid crop dimensions: width=%lu, height=%lu\r\n", 
						   (unsigned long)crop_width, (unsigned long)crop_height);
		return false;
	}

	DebugConsole_Printf("[AI] Crop %s: x=%lu y=%lu w=%lu h=%lu\r\n",
					   crop_label,
					   (unsigned long)crop_x_min, (unsigned long)crop_y_min,
					   (unsigned long)crop_width, (unsigned long)crop_height);

	if (APP_AI_ENABLE_VERBOSE_CONSOLE_LOGS)
	{
		AppAI_LogSourceCropWindow(frame_bytes, frame_size, source_width,
								  source_height, crop_x_min, crop_y_min, crop_width, crop_height);
	}

	(void)DebugConsole_WriteString("[AI] Preprocess diagnostics OK.\r\n");
	/* Keep legacy speed for 3-channel models, but if a wider tensor is
	 * provisioned (for example, feature-augmented channels), clear it first so
	 * unwritten channels are deterministic instead of stale SRAM. */
	if (input_len_bytes > (size_t)APP_AI_MODEL_INPUT_FLOAT_BYTES)
	{
		(void)memset(input_ptr, 0, input_len_bytes);
		DebugConsole_Printf(
			"[AI] Preprocess zero-fill applied for extended input: bytes=%lu\r\n",
			(unsigned long)input_len_bytes);
	}
	else
	{
		(void)DebugConsole_WriteString("[AI] Preprocess zero-fill skipped.\r\n");
	}
	(void)DebugConsole_WriteString("[AI] Preprocess resize start.\r\n");

#if APP_AI_YUV422_INPUT_LUMA_ONLY
	{
		const size_t output_width = (size_t)APP_AI_CAPTURE_FRAME_WIDTH_PIXELS;
		const size_t output_height = (size_t)APP_AI_CAPTURE_FRAME_HEIGHT_PIXELS;
		const size_t output_float_count = output_width * output_height * 3U;
		const size_t output_row_bytes = output_width * 3U * sizeof(float);
		const size_t output_total_bytes = output_float_count * sizeof(float);
		size_t resized_width = output_width;
		size_t resized_height = output_height;
		size_t resize_pad_x = 0U;
		size_t resize_pad_y = 0U;

		if ((output_width == 0U) || (output_height == 0U))
		{
			DebugConsole_Printf("[AI] PreprocessYuv422FrameToFloatInput: Invalid output dimensions: width=%lu, height=%lu\r\n",
							   (unsigned long)output_width, (unsigned long)output_height);
			return false;
		}

		if (output_total_bytes > input_len_bytes)
		{
			DebugConsole_Printf("[AI] PreprocessYuv422FrameToFloatInput: Output buffer too small: required=%lu, available=%lu\r\n",
							   (unsigned long)output_total_bytes,
							   (unsigned long)input_len_bytes);
			return false;
		}

		/* Keep the original aspect ratio using integer math only. */
		app_ai_scalar_preprocess_last_row = (size_t)SIZE_MAX;

		/* Fast path: when the crop already spans the output tensor, fill it
		 * directly without extra resize math or padding checks. */
		(void)DebugConsole_WriteString("[AI] Preprocess row loop enter (luma).\r\n");
		if ((crop_x_min == 0U) && (crop_y_min == 0U) &&
			(crop_width == output_width) && (crop_height == output_height))
		{
			resized_width = output_width;
			resized_height = output_height;
			resize_pad_x = 0U;
			resize_pad_y = 0U;

			for (size_t out_y = 0U; out_y < output_height; ++out_y)
			{
				uint8_t *const row_bytes =
					(uint8_t *)input_ptr + (out_y * output_row_bytes);

				app_ai_scalar_preprocess_last_row = out_y;
				if ((out_y == 0U) || ((out_y & 0x3FU) == 0U))
				{
					DebugConsole_Printf(
						"[AI] Preprocess luma row %lu/223\r\n",
						(unsigned long)out_y);
				}

				for (size_t out_x = 0U; out_x < output_width; ++out_x)
				{
					const size_t pixel_base = out_x * 3U * sizeof(float);
					const size_t read_index = ((out_y * source_width) + out_x) * 2U;
					const uint8_t gray = frame_bytes[read_index];
					const uint32_t gray_bits = AppAI_GrayToFloatBits(gray);

					{
						const uint8_t *const gray_bytes =
							(const uint8_t *)&gray_bits;

						row_bytes[pixel_base + 0U] = gray_bytes[0];
						row_bytes[pixel_base + 1U] = gray_bytes[1];
						row_bytes[pixel_base + 2U] = gray_bytes[2];
						row_bytes[pixel_base + 3U] = gray_bytes[3];

						row_bytes[pixel_base + 4U] = gray_bytes[0];
						row_bytes[pixel_base + 5U] = gray_bytes[1];
						row_bytes[pixel_base + 6U] = gray_bytes[2];
						row_bytes[pixel_base + 7U] = gray_bytes[3];

						row_bytes[pixel_base + 8U] = gray_bytes[0];
						row_bytes[pixel_base + 9U] = gray_bytes[1];
						row_bytes[pixel_base + 10U] = gray_bytes[2];
						row_bytes[pixel_base + 11U] = gray_bytes[3];
					}
				}
			}
		}
		else
		{
			if ((output_width * crop_height) <= (output_height * crop_width))
			{
				resized_width = output_width;
				resized_height = (size_t)(((crop_height * output_width) + (crop_width / 2U)) / crop_width);
			}
			else
			{
				resized_height = output_height;
				resized_width = (size_t)(((crop_width * output_height) + (crop_height / 2U)) / crop_height);
			}

			if (resized_width == 0U)
			{
				resized_width = 1U;
			}
			if (resized_height == 0U)
			{
				resized_height = 1U;
			}
			if (resized_width > output_width)
			{
				resized_width = output_width;
			}
			if (resized_height > output_height)
			{
				resized_height = output_height;
			}

			resize_pad_x = (output_width - resized_width) / 2U;
			resize_pad_y = (output_height - resized_height) / 2U;

			for (size_t out_y = 0U; out_y < output_height; ++out_y)
			{
				uint8_t *const row_bytes =
					(uint8_t *)input_ptr + (out_y * output_row_bytes);

				app_ai_scalar_preprocess_last_row = out_y;
				if ((out_y == 0U) || ((out_y & 0x3FU) == 0U))
				{
					DebugConsole_Printf(
						"[AI] Preprocess luma row %lu/223\r\n",
						(unsigned long)out_y);
				}

				if ((out_y < resize_pad_y) ||
					(out_y >= (resize_pad_y + resized_height)))
				{
					(void)memset(row_bytes, 0, output_row_bytes);
					continue;
				}

				for (size_t out_x = 0U; out_x < output_width; ++out_x)
				{
					const size_t pixel_base = out_x * 3U * sizeof(float);
					uint32_t gray_bits = 0U;

					if ((out_x >= resize_pad_x) &&
						(out_x < (resize_pad_x + resized_width)))
					{
						const size_t resized_x = out_x - resize_pad_x;
						const size_t resized_y = out_y - resize_pad_y;
						size_t sample_x =
							crop_x_min + ((resized_x * crop_width) / resized_width);
						size_t sample_y =
							crop_y_min + ((resized_y * crop_height) / resized_height);

						if (sample_x >= source_width)
						{
							sample_x = source_width - 1U;
						}
						if (sample_y >= source_height)
						{
							sample_y = source_height - 1U;
						}

						if ((sample_x < source_width) && (sample_y < source_height))
						{
							const size_t pair_x = sample_x & ~1U;
							const size_t source_index =
								((sample_y * source_width) + pair_x) * 2U;
							const size_t read_index =
								source_index + ((sample_x & 1U) ? 2U : 0U);

							if (read_index < frame_size)
							{
								const uint8_t gray = frame_bytes[read_index];
								gray_bits = AppAI_GrayToFloatBits(gray);
							}
						}
					}

					{
						const uint8_t *const gray_bytes =
							(const uint8_t *)&gray_bits;

