rishi-latchmepersad/embedded-gauge-reading-tinyml/firmware/stm32/n657/Appli/Src/app_ai.c
						row_bytes[pixel_base + 0U] = gray_bytes[0];
						row_bytes[pixel_base + 1U] = gray_bytes[1];
						row_bytes[pixel_base + 2U] = gray_bytes[2];
						row_bytes[pixel_base + 3U] = gray_bytes[3];

						row_bytes[pixel_base + 4U] = gray_bytes[0];
						row_bytes[pixel_base + 5U] = gray_bytes[1];
						row_bytes[pixel_base + 6U] = gray_bytes[2];
						row_bytes[pixel_base + 7U] = gray_bytes[3];

						row_bytes[pixel_base + 8U] = gray_bytes[0];
						row_bytes[pixel_base + 9U] = gray_bytes[1];
						row_bytes[pixel_base + 10U] = gray_bytes[2];
						row_bytes[pixel_base + 11U] = gray_bytes[3];
					}
				}
			}
		}
	}
#else
	{
		const size_t output_width = (size_t)APP_AI_CAPTURE_FRAME_WIDTH_PIXELS;
		const size_t output_height = (size_t)APP_AI_CAPTURE_FRAME_HEIGHT_PIXELS;
		const size_t output_float_count = output_width * output_height * 3U;
		
		/* Add bounds checking for output dimensions */
		if (output_width == 0U || output_height == 0U)
		{
			DebugConsole_Printf("[AI] PreprocessYuv422FrameToFloatInput: Invalid output dimensions: width=%lu, height=%lu\r\n", 
							   (unsigned long)output_width, (unsigned long)output_height);
			return false;
		}
		
		const float resize_scale =
			fminf((float)output_width / (float)crop_width,
				  (float)output_height / (float)crop_height);
		
		/* Add bounds checking for resize_scale */
		if (resize_scale <= 0.0f || !isfinite(resize_scale))
		{
			DebugConsole_Printf("[AI] PreprocessYuv422FrameToFloatInput: Invalid resize_scale: %f\r\n", (double)resize_scale);
			return false;
		}
		
		size_t resized_width = (size_t)(((float)crop_width * resize_scale) + 0.5f);
		size_t resized_height = (size_t)(((float)crop_height * resize_scale) + 0.5f);
		size_t resize_pad_x = 0U;
		size_t resize_pad_y = 0U;
		
#if APP_AI_ENABLE_VERBOSE_CONSOLE_LOGS
		DebugConsole_Printf(
			"[AI] Resize plan: mode=bilinear-pad output=%lux%lu crop=%lux%lu resized=%lux%lu scale=%.6f\r\n",
			(unsigned long)output_width, (unsigned long)output_height,
			(unsigned long)crop_width, (unsigned long)crop_height,
			(unsigned long)resized_width, (unsigned long)resized_height,
			(double)resize_scale);
#endif

		if ((output_width == 0U) || (output_height == 0U))
		{
			return false;
		}

		if (resized_width == 0U)
		{
			resized_width = 1U;
		}
		if (resized_height == 0U)
		{
			resized_height = 1U;
		}
		if (resized_width > output_width)
		{
			resized_width = output_width;
		}
		if (resized_height > output_height)
		{
			resized_height = output_height;
		}

		resize_pad_x = (output_width - resized_width) / 2U;
		resize_pad_y = (output_height - resized_height) / 2U;

		app_ai_scalar_preprocess_last_row = (size_t)SIZE_MAX;

		/* Row writer handles both active pixels and padded areas, so we do not
		 * bulk-clear the full tensor up-front. */
		if ((output_float_count * sizeof(float)) > input_len_bytes)
		{
			DebugConsole_Printf("[AI] PreprocessYuv422FrameToFloatInput: Output buffer too small: required=%lu, available=%lu\r\n", 
							   (unsigned long)(output_float_count * sizeof(float)), (unsigned long)input_len_bytes);
			return false;
		}

		(void)DebugConsole_WriteString("[AI] Preprocess row loop enter.\r\n");

		for (size_t chunk_start = 0U; chunk_start < output_height;
			 chunk_start += APP_AI_SCALAR_PREPROCESS_ROWS_PER_CHUNK)
		{
			const size_t chunk_end =
				((chunk_start + APP_AI_SCALAR_PREPROCESS_ROWS_PER_CHUNK) < output_height)
					? (chunk_start + APP_AI_SCALAR_PREPROCESS_ROWS_PER_CHUNK)
					: output_height;

			/* Add bounds checking for chunk_end */
			if (chunk_end > output_height)
			{
				DebugConsole_Printf("[AI] PreprocessYuv422FrameToFloatInput: chunk_end out of bounds: %lu > %lu\r\n", 
								   (unsigned long)chunk_end, (unsigned long)output_height);
				return false;
			}

			for (size_t out_y = chunk_start; out_y < chunk_end; out_y++)
			{
				/* Add bounds checking for out_y */
				if (out_y >= output_height)
				{
					DebugConsole_Printf("[AI] PreprocessYuv422FrameToFloatInput: out_y out of bounds: %lu >= %lu\r\n", 
									   (unsigned long)out_y, (unsigned long)output_height);
					return false;
				}
				
				app_ai_scalar_preprocess_last_row = out_y;

				if (!AppAI_PreprocessScalarRow(frame_bytes, frame_size, source_width,
											 source_height, crop_x_min, crop_y_min,
												crop_width, crop_height, output_width,
													 output_height, resize_scale, resized_width,
													 resized_height, resize_pad_x, resize_pad_y,
													 out_y, input_ptr, input_len_bytes))
				{
					DebugConsole_Printf("[AI] PreprocessYuv422FrameToFloatInput: AppAI_PreprocessScalarRow failed at row %lu\r\n", 
									   (unsigned long)out_y);
					return false;
				}
			}
		}

#if APP_AI_ENABLE_VERBOSE_CONSOLE_LOGS
		DebugConsole_WriteString("[AI] Preprocess write summary skipped.\r\n");
#endif /* APP_AI_ENABLE_VERBOSE_CONSOLE_LOGS */
	}

	(void)DebugConsole_WriteString("[AI] Preprocess resize OK.\r\n");

	return true;
}

static bool __attribute__((noinline)) AppAI_PreprocessYuv422FrameToInt8Input(
	const uint8_t *frame_bytes, size_t frame_size, uint8_t *input_ptr,
	size_t input_len_bytes, const LL_Buffer_InfoTypeDef *input_info)
{
	const size_t source_width = (size_t)APP_AI_CAPTURE_FRAME_WIDTH_PIXELS;
	const size_t source_height = (size_t)APP_AI_CAPTURE_FRAME_HEIGHT_PIXELS;
	const size_t output_width = (size_t)APP_AI_CAPTURE_FRAME_WIDTH_PIXELS;
	const size_t output_height = (size_t)APP_AI_CAPTURE_FRAME_HEIGHT_PIXELS;
	const size_t required_bytes = output_width * output_height * 3U;
	size_t crop_x_min = 0U;
	size_t crop_y_min = 0U;
	size_t crop_width = source_width;
	size_t crop_height = source_height;
	bool crop_found = false;
	const char *crop_label = "fixed";
	float scale_value = 1.0f / 255.0f;
	int16_t zero_point = 0;
	int32_t q_min = -128;
	int32_t q_max = 127;
	int32_t q_zero = 0;

	if ((frame_bytes == NULL) || (input_ptr == NULL) || (input_info == NULL))
	{
		return false;
	}
	if ((frame_size < (size_t)APP_AI_CAPTURE_FRAME_BYTES) ||
		(input_len_bytes < required_bytes))
	{
		return false;
	}

	if (input_info->scale != NULL)
	{
		(void)memcpy(&scale_value, input_info->scale, sizeof(scale_value));
	}
	if (input_info->offset != NULL)
	{
		(void)memcpy(&zero_point, input_info->offset, sizeof(zero_point));
	}
	if (scale_value <= 0.0f)
	{
		scale_value = 1.0f / 255.0f;
	}
	if (input_info->Qunsigned != 0U)
	{
		q_min = 0;
		q_max = 255;
	}
	q_zero = (int32_t)zero_point;
	if (q_zero < q_min)
	{
		q_zero = q_min;
	}
	if (q_zero > q_max)
	{
		q_zero = q_max;
	}

