rishi-latchmepersad/embedded-gauge-reading-tinyml/firmware/stm32/n657/Appli/Src/app_ai.c
		for (size_t row = 1U; row + 1U < output_dim; ++row)
		{
			for (size_t col = 0U; col < output_dim; ++col)
			{
				const size_t col_prev = (col == 0U) ? (output_dim - 1U) : (col - 1U);
				const size_t col_next = (col == output_dim - 1U) ? 0U : (col + 1U);
				const int32_t gx = (int32_t)polar_luma[row * output_dim + col_next]
					- (int32_t)polar_luma[row * output_dim + col_prev];
				const int32_t gy = (int32_t)polar_luma[(row + 1U) * output_dim + col]
					- (int32_t)polar_luma[(row - 1U) * output_dim + col];
				const uint8_t abs_gx = (uint8_t)((gx >= 0) ? gx : -gx);
				const uint8_t abs_gy = (uint8_t)((gy >= 0) ? gy : -gy);
				angular_hist[abs_gx]++;
				radial_hist[abs_gy]++;
			}
		}

		const uint8_t luma_threshold = AppAI_FindHistogramPercentile(
			luma_hist, 256U, total_luma_samples, 0.38f);
		const uint8_t angular_threshold = AppAI_FindHistogramPercentile(
			angular_hist, 256U, total_gradient_samples, 0.99f);
		const uint8_t radial_threshold = AppAI_FindHistogramPercentile(
			radial_hist, 256U, total_gradient_samples, 0.99f);
		const float angular_inv = (angular_threshold > 0U) ? (1.0f / (float)angular_threshold) : 1.0f;
		const float radial_inv = (radial_threshold > 0U) ? (1.0f / (float)radial_threshold) : 1.0f;
		const float luma_threshold_f = (float)luma_threshold / 255.0f;

		for (size_t row = 0U; row < output_dim; ++row)
		{
			const float row_position = (float)row / row_denominator;
			const float radial_mask = ((row_position >= 0.18f) && (row_position <= 0.95f)) ? 1.0f : 0.0f;
			if (radial_mask > 0.5f)
			{
				radial_mask_rows++;
			}
		}
		if (radial_mask_rows == 0U)
		{
			radial_mask_rows = 1U;
		}

		for (size_t row = 0U; row < output_dim; ++row)
		{
			for (size_t col = 0U; col < output_dim; ++col)
			{
				const size_t base = (row * output_dim + col) * channels;
				const float luma_val = (float)polar_luma[row * output_dim + col] / 255.0f;
				float ang_val = 0.0f;
				float rad_val = 0.0f;
				if ((row > 0U) && (row + 1U < output_dim))
				{
					const size_t col_prev = (col == 0U) ? (output_dim - 1U) : (col - 1U);
					const size_t col_next = (col == output_dim - 1U) ? 0U : (col + 1U);
					const int32_t gx = (int32_t)polar_luma[row * output_dim + col_next]
						- (int32_t)polar_luma[row * output_dim + col_prev];
					const int32_t gy = (int32_t)polar_luma[(row + 1U) * output_dim + col]
						- (int32_t)polar_luma[(row - 1U) * output_dim + col];
					const int32_t abs_gx = (gx >= 0) ? gx : -gx;
					const int32_t abs_gy = (gy >= 0) ? gy : -gy;
					ang_val = (float)abs_gx * angular_inv;
					rad_val = (float)abs_gy * radial_inv;
					if (row == 1U)
					{
						/* Keep the compiler honest about the normalized range. */
						if (ang_val < 0.0f) ang_val = 0.0f;
						if (rad_val < 0.0f) rad_val = 0.0f;
					}
				}

				{
					int32_t q_luma = (int32_t)polar_luma[row * output_dim + col] - 128;
					((int8_t *)input_ptr)[base + 3U] = (int8_t)q_luma;
				}
				{
					int32_t q_ang = (int32_t)lroundf(ang_val * 255.0f) - 128;
					if (q_ang < -128) q_ang = -128;
					if (q_ang > 127) q_ang = 127;
					((int8_t *)input_ptr)[base + 4U] = (int8_t)q_ang;
				}
				{
					int32_t q_rad = (int32_t)lroundf(rad_val * 255.0f) - 128;
					if (q_rad < -128) q_rad = -128;
					if (q_rad > 127) q_rad = 127;
					((int8_t *)input_ptr)[base + 5U] = (int8_t)q_rad;
				}

				{
					const float row_position = (float)row / row_denominator;
					const float radial_mask = ((row_position >= 0.18f) && (row_position <= 0.95f)) ? 1.0f : 0.0f;
					const float darkness = (0.62f - luma_val) / 0.62f;
					const float clipped_darkness = (darkness > 0.0f) ? ((darkness < 1.0f) ? darkness : 1.0f) : 0.0f;
					const float edge = (ang_val > 1.0f) ? 1.0f : ang_val;
					const float evidence = (0.65f * clipped_darkness + 0.35f * edge) * radial_mask;
					sum_evidence[col] += evidence;
				}
			}
		}

		{
			float score_min = 0.0f;
			float score_max = 0.0f;
			for (size_t col = 0U; col < output_dim; ++col)
			{
				float best_run = 0.0f;
				float run = 0.0f;
				for (size_t row = 0U; row < output_dim; ++row)
				{
					const float row_position = (float)row / row_denominator;
					const float radial_mask = ((row_position >= 0.18f) && (row_position <= 0.95f)) ? 1.0f : 0.0f;
					const uint8_t luma_q = polar_luma[row * output_dim + col];
					if ((radial_mask > 0.5f) && (luma_q <= luma_threshold))
					{
						run += 1.0f;
						if (run > best_run)
						{
							best_run = run;
						}
					}
					else
					{
						run = 0.0f;
					}
				}
				continuity[col] = best_run / (float)output_dim;
				score[col] = (0.70f * (sum_evidence[col] / (float)radial_mask_rows)) + (0.30f * continuity[col]);
			}

			for (size_t col = 0U; col < output_dim; ++col)
			{
				const size_t prev = (col == 0U) ? (output_dim - 1U) : (col - 1U);
				const size_t next = (col == (output_dim - 1U)) ? 0U : (col + 1U);
				score[col] = (0.50f * score[col]) + (0.25f * score[prev]) + (0.25f * score[next]);
			}
			score_min = score[0U];
			score_max = score[0U];
			for (size_t col = 1U; col < output_dim; ++col)
			{
				if (score[col] < score_min)
				{
					score_min = score[col];
				}
				if (score[col] > score_max)
				{
					score_max = score[col];
				}
			}
			for (size_t col = 0U; col < output_dim; ++col)
			{
				float prior = score[col] - score_min;
				if (score_max > score_min)
				{
					prior = prior / (score_max - score_min);
				}
				if (prior < 0.0f)
				{
					prior = 0.0f;
				}
				else if (prior > 1.0f)
				{
					prior = 1.0f;
				}

				{
					const int32_t q_prior = (int32_t)lroundf(prior * 255.0f) - 128;
					for (size_t row = 0U; row < output_dim; ++row)
					{
						const size_t pixel_base = (row * output_dim + col) * channels;
						int32_t clipped = q_prior;
						if (clipped < -128) clipped = -128;
						if (clipped > 127) clipped = 127;
						((int8_t *)input_ptr)[pixel_base + 6U] = (int8_t)clipped;
					}
				}
			}
		}
	}

	(void)DebugConsole_WriteString("[AI] Polar preprocess OK.\r\n");
	return true;
}

static float AppAI_ClampNormalizedFloat(float value)
{
	/* Add additional validation for NaN and infinity */
	if (!isfinite(value))
	{
		DebugConsole_Printf("[AI] ClampNormalizedFloat: Invalid value: %f\r\n", (double)value);
		return 0.0f;
	}

	if (value < 0.0f)
	{
		return 0.0f;
	}

	if (value > 1.0f)
	{
		return 1.0f;
	}

	return value;
}

static uint8_t __attribute__((noinline)) AppAI_ReadYuv422Luma(
	const uint8_t *frame_bytes, size_t frame_size_bytes,
	size_t frame_width_pixels, size_t source_x, size_t source_y)
{
	if (frame_bytes == NULL)
	{
		return 0U;
	}

	if (frame_size_bytes < 4U)
	{
		return 0U;
	}

	if (frame_width_pixels == 0U)
	{
		return 0U;
	}

	if (source_x >= frame_width_pixels)
	{
		return 0U;
	}

	if (source_y >= (size_t)APP_AI_CAPTURE_FRAME_HEIGHT_PIXELS)
	{
		return 0U;
	}

