rishi-latchmepersad/embedded-gauge-reading-tinyml/firmware/stm32/n657/Appli/Src/app_ai.c
	const size_t pair_x = source_x & ~1U;
	const size_t source_index = ((source_y * frame_width_pixels) + pair_x) * 2U;
	if (source_index >= frame_size_bytes)
	{
		return 0U;
	}

	const bool is_second_pixel = ((source_x & 1U) != 0U);
	const size_t read_index = source_index + (is_second_pixel ? 2U : 0U);
	if (read_index >= frame_size_bytes)
	{
		return 0U;
	}

	return frame_bytes[read_index];
}

static void AppAI_ReadYuv422Quartet(const uint8_t *frame_bytes,
									size_t frame_size_bytes,
									size_t frame_width_pixels, size_t source_x, size_t source_y,
									uint8_t *quad_out)
{
	if ((frame_bytes == NULL) || (quad_out == NULL) ||
		(frame_size_bytes < 4U) ||
		(source_x >= frame_width_pixels) ||
		(source_y >= (size_t)APP_AI_CAPTURE_FRAME_HEIGHT_PIXELS))
	{
		return;
	}

	const size_t pair_x = source_x & ~1U;
	const size_t source_index = ((source_y * frame_width_pixels) + pair_x) * 2U;
	if ((source_index + 3U) >= frame_size_bytes)
	{
		return;
	}

	quad_out[0] = frame_bytes[source_index + 0U];
	quad_out[1] = frame_bytes[source_index + 1U];
	quad_out[2] = frame_bytes[source_index + 2U];
	quad_out[3] = frame_bytes[source_index + 3U];
}

static float AppAI_ReadNormalizedGrayFromYuv422Pixel(const uint8_t *frame_bytes,
													 size_t frame_size_bytes,
													 size_t frame_width_pixels, size_t source_x, size_t source_y)
{
	/* Add additional bounds checking and validation */
	if ((frame_bytes == NULL) || (frame_size_bytes < 4U) ||
		(frame_width_pixels == 0U) || (source_x >= frame_width_pixels) ||
		(source_y >= (size_t)APP_AI_CAPTURE_FRAME_HEIGHT_PIXELS))
	{
		DebugConsole_Printf("[AI] ReadNormalizedGrayFromYuv422Pixel: Invalid parameters or out of bounds\r\n");
		return 0.0f;
	}

	const uint8_t luma = AppAI_ReadYuv422Luma(frame_bytes, frame_size_bytes, frame_width_pixels,
											  source_x, source_y);
	const float normalized = ((float)luma) / 255.0f;

	return AppAI_ClampNormalizedFloat(normalized);
}

static void AppAI_ReadRgbFromYuv422Pixel(const uint8_t *frame_bytes,
										 size_t frame_size_bytes,
										 size_t frame_width_pixels, size_t source_x, size_t source_y,
										 float *r_out, float *g_out, float *b_out)
{
	/* Add additional bounds checking and validation */
	if (frame_bytes == NULL)
	{
		DebugConsole_Printf("[AI] ReadRgbFromYuv422Pixel: NULL frame_bytes pointer\r\n");
		if (r_out != NULL)
		{
			*r_out = 0.0f;
		}
		if (g_out != NULL)
		{
			*g_out = 0.0f;
		}
		if (b_out != NULL)
		{
			*b_out = 0.0f;
		}
		return;
	}

	if (frame_size_bytes < 4U)
	{
		DebugConsole_Printf("[AI] ReadRgbFromYuv422Pixel: frame_size_bytes too small: %lu\r\n", (unsigned long)frame_size_bytes);
		if (r_out != NULL)
		{
			*r_out = 0.0f;
		}
		if (g_out != NULL)
		{
			*g_out = 0.0f;
		}
		if (b_out != NULL)
		{
			*b_out = 0.0f;
		}
		return;
	}

	if (frame_width_pixels == 0U)
	{
		DebugConsole_Printf("[AI] ReadRgbFromYuv422Pixel: frame_width_pixels is zero\r\n");
		if (r_out != NULL)
		{
			*r_out = 0.0f;
		}
		if (g_out != NULL)
		{
			*g_out = 0.0f;
		}
		if (b_out != NULL)
		{
			*b_out = 0.0f;
		}
		return;
	}

	if (source_x >= frame_width_pixels)
	{
		DebugConsole_Printf("[AI] ReadRgbFromYuv422Pixel: source_x out of bounds: %lu >= %lu\r\n", 
						   (unsigned long)source_x, (unsigned long)frame_width_pixels);
		if (r_out != NULL)
		{
			*r_out = 0.0f;
		}
		if (g_out != NULL)
		{
			*g_out = 0.0f;
		}
		if (b_out != NULL)
		{
			*b_out = 0.0f;
		}
		return;
	}

	if (source_y >= (size_t)APP_AI_CAPTURE_FRAME_HEIGHT_PIXELS)
	{
		DebugConsole_Printf("[AI] ReadRgbFromYuv422Pixel: source_y out of bounds: %lu >= %lu\r\n", 
						   (unsigned long)source_y, (unsigned long)APP_AI_CAPTURE_FRAME_HEIGHT_PIXELS);
		if (r_out != NULL)
		{
			*r_out = 0.0f;
		}
		if (g_out != NULL)
		{
			*g_out = 0.0f;
		}
		if (b_out != NULL)
		{
			*b_out = 0.0f;
		}
		return;
	}

	/* Add additional validation for frame dimensions */
	if (frame_width_pixels != (size_t)APP_AI_CAPTURE_FRAME_WIDTH_PIXELS)
	{
		DebugConsole_Printf("[AI] ReadRgbFromYuv422Pixel: frame_width_pixels mismatch: %lu != %lu\r\n", 
						   (unsigned long)frame_width_pixels, (unsigned long)APP_AI_CAPTURE_FRAME_WIDTH_PIXELS);
		/* Continue processing but log the mismatch */
	}

#if APP_AI_YUV422_INPUT_LUMA_ONLY
	const float gray = AppAI_ReadNormalizedGrayFromYuv422Pixel(frame_bytes,
															   frame_size_bytes,
															   frame_width_pixels, source_x, source_y);
	const float r = gray;
	const float g = gray;
	const float b = gray;
#else
	const size_t pair_x = source_x & ~1U;
	const size_t source_index = ((source_y * frame_width_pixels) + pair_x) * 2U;
	
	/* Add bounds checking for source_index calculation */
	if (source_index >= frame_size_bytes)
	{
		DebugConsole_Printf("[AI] ReadRgbFromYuv422Pixel: source_index out of bounds: %lu >= %lu\r\n", 
						   (unsigned long)source_index, (unsigned long)frame_size_bytes);
		if (r_out != NULL)
		{
			*r_out = 0.0f;
		}
		if (g_out != NULL)
		{
			*g_out = 0.0f;
		}
		if (b_out != NULL)
		{
			*b_out = 0.0f;
		}
		return;
	}

	const bool is_second_pixel = ((source_x & 1U) != 0U);

	/* The RGB path touches three adjacent bytes per pixel, so make the read
	 * bounds explicit before we let the compiler emit the loads. */
	if ((source_index + 3U) >= frame_size_bytes)
	{
		DebugConsole_Printf("[AI] ReadRgbFromYuv422Pixel: source_index+3 out of bounds: %lu >= %lu\r\n", 
						   (unsigned long)(source_index + 3U), (unsigned long)frame_size_bytes);
		if (r_out != NULL)
		{
			*r_out = 0.0f;
		}
		if (g_out != NULL)
		{
			*g_out = 0.0f;
		}
		if (b_out != NULL)
		{
			*b_out = 0.0f;
		}
		return;
	}

	/* Add additional validation that we're not reading beyond the end of the buffer */
	const size_t y_index = source_index + (is_second_pixel ? 2U : 0U);
	const size_t u_index = source_index + 1U;
	const size_t v_index = source_index + 3U;
	
