rishi-latchmepersad/embedded-gauge-reading-tinyml/firmware/stm32/n657/Appli/Src/app_ai.c
	const float r00 = ((float)rgb_bytes[base00 + 0U]) / 255.0f;
	const float g00 = ((float)rgb_bytes[base00 + 1U]) / 255.0f;
	const float b00 = ((float)rgb_bytes[base00 + 2U]) / 255.0f;
	const float r10 = ((float)rgb_bytes[base10 + 0U]) / 255.0f;
	const float g10 = ((float)rgb_bytes[base10 + 1U]) / 255.0f;
	const float b10 = ((float)rgb_bytes[base10 + 2U]) / 255.0f;
	const float r01 = ((float)rgb_bytes[base01 + 0U]) / 255.0f;
	const float g01 = ((float)rgb_bytes[base01 + 1U]) / 255.0f;
	const float b01 = ((float)rgb_bytes[base01 + 2U]) / 255.0f;
	const float r11 = ((float)rgb_bytes[base11 + 0U]) / 255.0f;
	const float g11 = ((float)rgb_bytes[base11 + 1U]) / 255.0f;
	const float b11 = ((float)rgb_bytes[base11 + 2U]) / 255.0f;

	if (r_out != NULL)
	{
		const float top_r = r00 + (fx * (r10 - r00));
		const float bottom_r = r01 + (fx * (r11 - r01));
		*r_out = AppAI_ClampNormalizedFloat(top_r + (fy * (bottom_r - top_r)));
	}
	if (g_out != NULL)
	{
		const float top_g = g00 + (fx * (g10 - g00));
		const float bottom_g = g01 + (fx * (g11 - g01));
		*g_out = AppAI_ClampNormalizedFloat(top_g + (fy * (bottom_g - top_g)));
	}
	if (b_out != NULL)
	{
		const float top_b = b00 + (fx * (b10 - b00));
		const float bottom_b = b01 + (fx * (b11 - b01));
		*b_out = AppAI_ClampNormalizedFloat(top_b + (fy * (bottom_b - top_b)));
	}
}

static uint8_t AppAI_FindHistogramPercentile(const uint32_t *histogram,
											 size_t histogram_len,
											 uint32_t total_count,
											 float percentile)
{
	uint32_t target = 0U;
	uint32_t cumulative = 0U;
	size_t bin = 0U;

	if ((histogram == NULL) || (histogram_len == 0U) || (total_count == 0U))
	{
		return 0U;
	}

	if (percentile < 0.0f)
	{
		percentile = 0.0f;
	}
	if (percentile > 1.0f)
	{
		percentile = 1.0f;
	}

	target = (uint32_t)ceilf(percentile * (float)total_count);
	if (target == 0U)
	{
		target = 1U;
	}

	for (bin = 0U; bin < histogram_len; ++bin)
	{
		cumulative += histogram[bin];
		if (cumulative >= target)
		{
			return (uint8_t)bin;
		}
	}

	return (uint8_t)(histogram_len - 1U);
}

/**
 * @brief Global softargmax on an int8 heatmap.
 *
 * Matches the Python training decode: softargmax_2d() which computes
 * the global weighted centroid over the entire heatmap.
 *
 * Formula: normalized = heatmap / sum(heatmap)
 *          expected_x = sum(normalized * x_coords)
 *          expected_y = sum(normalized * y_coords)
 *
 * Returns false if the heatmap has no positive activations.
 */
static bool AppAI_SoftArgmaxGlobal(const int8_t *heatmap, int32_t size,
	float *x_out, float *y_out)
{
	if ((heatmap == NULL) || (x_out == NULL) || (y_out == NULL) || (size <= 0))
	{
		return false;
	}

	/* First pass: compute global max for numerical stability, then sum */
	float global_max = -128.0f;
	for (int32_t i = 0; i < size * size; i++)
	{
		const float val = (float)heatmap[i];
		if (val > global_max) { global_max = val; }
	}

	/* Second pass: compute exp(heatmap - global_max) and accumulate */
	float total_weight = 0.0f;
	float sum_x = 0.0f;
	float sum_y = 0.0f;

	for (int32_t py = 0; py < size; py++)
	{
		for (int32_t px = 0; px < size; px++)
		{
			const float v = (float)heatmap[py * size + px] - global_max;
			const float e = expf(v);
			total_weight += e;
			sum_x += e * (float)px;
			sum_y += e * (float)py;
		}
	}

	if (total_weight < 1e-6f)
	{
		return false;
	}

	*x_out = sum_x / total_weight;
	*y_out = sum_y / total_weight;
	return true;
}

/**
 * @brief Reset the tip-focus median history to a fresh seed value.
 *
 * When the reading has drifted far from the last published value for several
 * consecutive frames, the historical median needs a hard re-seed so the live
 * value can catch up instead of being pinned forever by an old stable state.
 */
static void AppAI_TipFocus_ResetMedianHistory(float seed_value)
{
	size_t i;

	for (i = 0U; i < APP_AI_TIP_FOCUS_MEDIAN_BUFFER_SIZE; i++)
	{
		app_ai_tip_focus_median_buffer[i] = seed_value;
	}

	app_ai_tip_focus_median_count = APP_AI_TIP_FOCUS_MEDIAN_BUFFER_SIZE;
	app_ai_tip_focus_median_index = 0U;
	app_ai_tip_focus_last_published = seed_value;
	app_ai_tip_focus_last_published_valid = true;
	app_ai_tip_focus_outlier_streak = 0U;
}

/**
 * @brief 3-sample median filter with outlier rejection.
 *
 * Maintains a ring buffer of accepted tip-focus temperatures.  If the new
 * value deviates from the current median by more than the outlier threshold,
 * it is rejected and the last published value is returned unchanged.
 */
static float AppAI_TipFocus_MedianFilter(float new_value)
{
	/* If no buffer history yet, initialise with the first value */
	if (app_ai_tip_focus_median_count < APP_AI_TIP_FOCUS_MEDIAN_BUFFER_SIZE)
	{
		app_ai_tip_focus_median_buffer[app_ai_tip_focus_median_count] = new_value;
		app_ai_tip_focus_median_count++;
		app_ai_tip_focus_last_published = new_value;
		app_ai_tip_focus_outlier_streak = 0U;
		return new_value;
	}

	/* Compute current median */
	float sorted[APP_AI_TIP_FOCUS_MEDIAN_BUFFER_SIZE];
	(void)memcpy(sorted, app_ai_tip_focus_median_buffer, sizeof(sorted));
	/* Simple bubble sort for 3 elements */
	for (size_t i = 0U; i < APP_AI_TIP_FOCUS_MEDIAN_BUFFER_SIZE; i++)
	{
		for (size_t j = i + 1U; j < APP_AI_TIP_FOCUS_MEDIAN_BUFFER_SIZE; j++)
		{
			if (sorted[i] > sorted[j])
			{
				const float tmp = sorted[i];
				sorted[i] = sorted[j];
				sorted[j] = tmp;
			}
		}
	}
	const float median = sorted[APP_AI_TIP_FOCUS_MEDIAN_BUFFER_SIZE / 2U];

	/* Outlier rejection: if new value is too far from median, hold last published */
	const float delta = (new_value > median) ? (new_value - median) : (median - new_value);
	if (delta > APP_AI_TIP_FOCUS_MAX_OUTLIER_DELTA_C)
	{
		app_ai_tip_focus_outlier_streak++;
		if (app_ai_tip_focus_outlier_streak >= APP_AI_TIP_FOCUS_OUTLIER_RESET_STREAK)
		{
			DebugConsole_Printf(
				"[AI][TIP_FOCUS] Outlier %.2f C delta=%.2f > %.1f; re-seeding median with %.2f\r\n",
				new_value, delta, APP_AI_TIP_FOCUS_MAX_OUTLIER_DELTA_C,
				new_value);
			AppAI_TipFocus_ResetMedianHistory(new_value);
			return new_value;
		}

