rishi-latchmepersad/embedded-gauge-reading-tinyml/firmware/stm32/n657/Appli/Src/app_ai.c
		DebugConsole_Printf(
			"[AI][TIP_FOCUS] Outlier %.2f C delta=%.2f > %.1f; holding %.2f (streak=%lu/%u)\r\n",
			new_value, delta, APP_AI_TIP_FOCUS_MAX_OUTLIER_DELTA_C,
			app_ai_tip_focus_last_published,
			(unsigned long)app_ai_tip_focus_outlier_streak,
			(unsigned)APP_AI_TIP_FOCUS_OUTLIER_RESET_STREAK);
		return app_ai_tip_focus_last_published;
	}

	app_ai_tip_focus_outlier_streak = 0U;

	/* Insert new value into ring buffer */
	app_ai_tip_focus_median_buffer[app_ai_tip_focus_median_index] = new_value;
	app_ai_tip_focus_median_index = (app_ai_tip_focus_median_index + 1U)
		% APP_AI_TIP_FOCUS_MEDIAN_BUFFER_SIZE;

	/* Recompute median after insertion */
	(void)memcpy(sorted, app_ai_tip_focus_median_buffer, sizeof(sorted));
	for (size_t i = 0U; i < APP_AI_TIP_FOCUS_MEDIAN_BUFFER_SIZE; i++)
	{
		for (size_t j = i + 1U; j < APP_AI_TIP_FOCUS_MEDIAN_BUFFER_SIZE; j++)
		{
			if (sorted[i] > sorted[j])
			{
				const float tmp = sorted[i];
				sorted[i] = sorted[j];
				sorted[j] = tmp;
			}
		}
	}
	const float new_median = sorted[APP_AI_TIP_FOCUS_MEDIAN_BUFFER_SIZE / 2U];
	app_ai_tip_focus_last_published = new_median;
	return new_median;
}

bool App_AI_GetLastInferenceResult(float *value_out)
{
	if (value_out == NULL)
	{
		return false;
	}
	if (!app_ai_last_inference_valid)
	{
		return false;
	}
	if (!AppAI_IsFiniteFloat(app_ai_last_inference_value))
	{
		return false;
	}
	if (!AppAI_IsPlausibleInferenceValue(app_ai_last_inference_value))
	{
		return false;
	}
	*value_out = app_ai_last_inference_value;
	return true;
}

/**
 * @brief Verify that the rectifier weights have been flashed to xSPI2.
 * @retval true xSPI2 flash contains valid rectifier weights.
 * @retval false xSPI2 flash is empty or corrupted - run flash_boot.bat.
 */
bool AppAI_VerifyRectifierWeights(void)
{
	uint8_t actual_start[APP_AI_XSPI2_PROBE_BYTES] = {0U};
	int32_t read_status;
	size_t i;
	bool match;

	/* Ensure xSPI2 is initialized before probing. */
	if (!app_ai_xspi2_initialized)
	{
		if (!AppAI_ReconfigureXspi2ForRuntime())
		{
			DebugConsole_WriteString(
				"[AI][RECTIFIER] xSPI2 reconfigure for verification failed.\r\n");
			return false;
		}
	}

	/* Read the first 16 bytes from xSPI2 flash at 0x70600000.
	 * The chip offset for rectifier is 0x70600000 - 0x70000000 = 0x600000. */
	const uint32_t rectifier_chip_offset = 0x00600000U;

	read_status = BSP_XSPI_NOR_Read(0U, actual_start,
									rectifier_chip_offset,
									APP_AI_XSPI2_PROBE_BYTES);
	if (read_status != BSP_ERROR_NONE)
	{
		DebugConsole_Printf(
			"[AI][RECTIFIER] xSPI2 read failed: status=%ld\r\n",
			(long)read_status);
		return false;
	}

	/* Compare against expected signature. */
	match = true;
	for (i = 0U; i < APP_AI_XSPI2_PROBE_BYTES; i++)
	{
		if (actual_start[i] != app_ai_rectifier_xspi2_signature_start[i])
		{
			match = false;
			break;
		}
	}

	if (!match)
	{
		DebugConsole_WriteString(
			"[AI][RECTIFIER] xSPI2 flash signature mismatch!\r\n");
		DebugConsole_WriteString(
			"[AI][RECTIFIER] Expected: ");
		for (i = 0U; i < APP_AI_XSPI2_PROBE_BYTES; i++)
		{
			DebugConsole_Printf("%02X", app_ai_rectifier_xspi2_signature_start[i]);
		}
		DebugConsole_WriteString("\r\n[AI][RECTIFIER] Actual:   ");
		for (i = 0U; i < APP_AI_XSPI2_PROBE_BYTES; i++)
		{
			DebugConsole_Printf("%02X", actual_start[i]);
		}
		DebugConsole_WriteString("\r\n");
		DebugConsole_WriteString(
			"[AI][RECTIFIER] CRITICAL: Run flash_boot.bat to flash atonbuf.rectifier.xSPI2.raw\r\n");
		DebugConsole_WriteString(
			"[AI][RECTIFIER] to 0x70600000 before running inference.\r\n");
		return false;
	}

	DebugConsole_WriteString(
		"[AI][RECTIFIER] xSPI2 weights signature OK.\r\n");
	return true;
}

/**
 * @brief Verify that the tip-focus weights have been flashed to xSPI2.
 * @retval true xSPI2 flash contains valid tip-focus weights.
 * @retval false xSPI2 flash is empty or corrupted - run flash_boot.bat.
 */
bool AppAI_VerifyTipFocusWeights(void)
{
	uint8_t actual_start[APP_AI_XSPI2_PROBE_BYTES] = {0U};
	int32_t read_status;
	size_t i;
	bool match;

	/* Ensure xSPI2 is initialized before probing. */
	if (!app_ai_xspi2_initialized)
	{
		if (!AppAI_ReconfigureXspi2ForRuntime())
		{
			DebugConsole_WriteString(
				"[AI][TIP_FOCUS] xSPI2 reconfigure for verification failed.\r\n");
			return false;
		}
	}

	/* Read the first 16 bytes from xSPI2 flash at 0x70400000.
	 * The chip offset for tip-focus is 0x70400000 - 0x70000000 = 0x400000. */
	const uint32_t tip_focus_chip_offset = 0x00400000U;

	read_status = BSP_XSPI_NOR_Read(0U, actual_start,
									tip_focus_chip_offset,
									APP_AI_XSPI2_PROBE_BYTES);
	if (read_status != BSP_ERROR_NONE)
	{
		DebugConsole_Printf(
			"[AI][TIP_FOCUS] xSPI2 read failed: status=%ld\r\n",
			(long)read_status);
		return false;
	}

	/* Compare against expected signature. */
	match = true;
	for (i = 0U; i < APP_AI_XSPI2_PROBE_BYTES; i++)
	{
		if (actual_start[i] != app_ai_tip_focus_xspi2_signature_start[i])
		{
			match = false;
			break;
		}
	}

	if (!match)
	{
		DebugConsole_WriteString(
			"[AI][TIP_FOCUS] xSPI2 flash signature mismatch!\r\n");
		DebugConsole_WriteString(
			"[AI][TIP_FOCUS] Expected: ");
		for (i = 0U; i < APP_AI_XSPI2_PROBE_BYTES; i++)
		{
			DebugConsole_Printf("%02X", app_ai_tip_focus_xspi2_signature_start[i]);
		}
		DebugConsole_WriteString("\r\n[AI][TIP_FOCUS] Actual:   ");
		for (i = 0U; i < APP_AI_XSPI2_PROBE_BYTES; i++)
		{
			DebugConsole_Printf("%02X", actual_start[i]);
		}
		DebugConsole_WriteString("\r\n");
		DebugConsole_WriteString(
			"[AI][TIP_FOCUS] CRITICAL: Run flash_boot.bat to flash atonbuf.tip_focus.xSPI2.raw\r\n");
		DebugConsole_WriteString(
			"[AI][TIP_FOCUS] to 0x70400000 before running inference.\r\n");
		return false;
	}

	DebugConsole_WriteString(
		"[AI][TIP_FOCUS] xSPI2 weights signature OK.\r\n");
	return true;
}

bool AppAI_Xspi2EnsureMemoryMappedMode(void)
{
	/* Fast-path: if xSPI2 is already in memory-mapped mode, skip directly. */
	if (app_ai_xspi2_mm_enabled)
	{
		return true;
	}

	/* Before enabling MM mode, make sure the xSPI2 peripheral is initialized
	 * and the flash is accessible.  If the peripheral was left de-inited by a
	 * prior stage, re-init it first. */
	if (!app_ai_xspi2_initialized)
	{
		if (!AppAI_ReconfigureXspi2ForRuntime())
		{
			(void)DebugConsole_WriteString("[AI] xSPI2 runtime reconfigure failed.\r\n");
			return false;
		}
	}

	if (!AppAI_Xspi2EnableMemoryMappedMode())
	{
		return false;
	}

	/* Ensure the memory-mapped window is visible to all bus masters before
	 * the NPU starts reading weight data from xSPI2 flash. */
	__DSB();
	__ISB();
	return true;
}

/* USER CODE END 1 */
